{"id":1316,"date":"2022-10-05T09:58:16","date_gmt":"2022-10-05T09:58:16","guid":{"rendered":"https:\/\/mudratcs.com\/frank\/?p=1316"},"modified":"2023-11-01T11:21:10","modified_gmt":"2023-11-01T11:21:10","slug":"strategies-for-the-sandwich-generation","status":"publish","type":"post","link":"https:\/\/frankbrunolaw.com\/strategies-for-the-sandwich-generation\/","title":{"rendered":"Strategies for the “Sandwich” Generation"},"content":{"rendered":"<p>If you are taking care of your aging parents and still helping your own children, you are part of the “sandwich” generation. If you feel as if you will never be able to go off duty because of all the people who make demands on your time and money, here are some strategies for the “sandwich” generation.<\/p>\n<p>Quite a few people start having children when they are in their forties. Your parents could already be in their sixties and seventies, when you have toddlers. By the time your children are in high school, you will be in your fifties with parents in their seventies or eighties. You should be focused on plowing lots of money into your retirement account. However, instead you find yourself pulled in many different directions, without the energy or resources you need for yourself.<\/p>\n<h2 class=\"has-text-align-center\" style=\"text-align: left;\"><span style=\"color: #3bb4c9;\">How People with Adult Children Can Get Pulled at Both Ends: Strategies for the “Sandwich” Generation<\/span><\/h2>\n<p>You do not have to be raising young children to be in the sandwich generation. Your children might be adults but need financial help because of student loans or other financial pressures. Additional reasons you might need to assist your adult children include things like:<\/p>\n<ul>\n<li>You have a child with a disability.<\/li>\n<li>One of your children struggles with substance abuse.<\/li>\n<li>You have a twenty-something or older child, who is in graduate school.<\/li>\n<li>You provide much of the childcare for or you raise one of your grandchildren.<\/li>\n<\/ul>\n<p>These are only a few examples of the reasons you might find yourself having to lend a helping hand to your parents and your adult children.<\/p>\n<h2 class=\"has-text-align-center\" style=\"text-align: left;\"><span style=\"color: #3bb4c9;\">The Financial Impact of Taking Care of Two Generations: Strategies for the “Sandwich” Generation<\/span><\/h2>\n<p>Any of these situations can put demands on your time, energy and finances. People who take care of their older parents and their own children often suffer as a result. For example, these caregivers drive everyone else to their medical appointments but do not have to time to go for routine checkups. There are not enough hours in the day to go for a walk to de-stress or get physical exercise. Sleep deprivation is common among “sandwichers.”<\/p>\n<p>The financial impact of dual caregiving can be both short-term and long-term. If you are constantly picking up medications and groceries for your elderly parents and helping your children financially, you might find yourself having a cash flow strain. The time the double caregiving takes from your schedule can also make it impossible for you to engage in the amount of gainful employment you would like, so you can increase your retirement savings.<\/p>\n<h3 class=\"has-text-align-center\" style=\"text-align: left;\"><span style=\"color: #3bb4c9;\">How to Handle the Stress and Exhaustion of Dual Caregiving: Strategies for the “Sandwich” Generation<\/span><\/h3>\n<p>You are not alone. Many people have walked this path before you. They offer these suggestions:<\/p>\n<ul>\n<li><strong>Contact your local government agencies, community groups, senior organizations and charitable entities to find as many resources as possible to take some of the weight off of your shoulders<\/strong>. Adult day programs, respite care and other services can be a godsend.<\/li>\n<li><strong>Find sources of funding to ease your financial strain<\/strong>. Your aging parents might qualify for more benefits than they currently receive. You can use the website Benefit Finder to locate additional financial help, like Medicare, Medicaid, veterans benefits and many other programs.<\/li>\n<li><strong>Change your expectations<\/strong>. Your house does not have to be perfect. Your teens can get rides with friends, or you can set up a carpool.<\/li>\n<li><strong>Set a daily sleep goal of at least seven hours and stick to it<\/strong>. You cannot help anyone, if you get so exhausted that your health deteriorates.<\/li>\n<li><strong>Try to find the humor in daily situations<\/strong>.<\/li>\n<\/ul>\n<p>Remember, this stage and every stage is temporary. You are creating memories that you will treasure.<\/p>\n<p><em>References<\/em>:<\/p>\n<p><a href=\"https:\/\/www.huffpost.com\/\" target=\"_blank\" rel=\"noreferrer noopener\"><span style=\"color: #3bb4c9;\"><strong>HuffPost<\/strong> <\/span><\/a>– “<strong><span style=\"color: #3bb4c9;\"><a style=\"color: #3bb4c9;\" href=\"https:\/\/www.huffpost.com\/entry\/sandwich-generation-caring-for-kids-parents_n_5d24c00ee4b07e698c418fc9\" target=\"_blank\" rel=\"noreferrer noopener\">This Is What No One Told Me About Suddenly Joining The Sandwich Generation<\/a>.<\/span><\/strong>” (accessed November 8, 2019)<\/p>\n<p><strong><span style=\"color: #3bb4c9;\"><a style=\"color: #3bb4c9;\" href=\"https:\/\/www.benefits.gov\/\" target=\"_blank\" rel=\"noreferrer noopener\">Benefits.gov<\/a><\/span> <\/strong>– “<span style=\"color: #3bb4c9;\"><strong><a style=\"color: #3bb4c9;\" href=\"https:\/\/www.benefits.gov\/benefit-finder\" target=\"_blank\" rel=\"noreferrer noopener\">Benefit Finder<\/a><\/strong>.<\/span>” (accessed November 14, 2019)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you are taking care of your aging parents and still helping your own children, you are part of the “sandwich” generation. If you feel as if you will never be able to go off duty because of all the people who make demands on your time and money, here are some strategies for the<\/p>\n","protected":false},"author":1,"featured_media":1318,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[20,10,11],"tags":[],"class_list":["post-1316","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-blog","category-elder-law","category-estate-planning"],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1316","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/comments?post=1316"}],"version-history":[{"count":0,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1316\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media\/1318"}],"wp:attachment":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media?parent=1316"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/categories?post=1316"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/tags?post=1316"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}