{"id":1333,"date":"2022-07-10T10:30:15","date_gmt":"2022-07-10T10:30:15","guid":{"rendered":"https:\/\/mudratcs.com\/frank\/?p=1333"},"modified":"2024-05-27T06:46:13","modified_gmt":"2024-05-27T06:46:13","slug":"surviving-spouse-needs-an-estate-plan","status":"publish","type":"post","link":"https:\/\/frankbrunolaw.com\/surviving-spouse-needs-an-estate-plan\/","title":{"rendered":"Surviving Spouse Needs An Estate Plan"},"content":{"rendered":"<p><em>“If there ever comes a day when we can’t be together, keep me in your heart. I’ll stay there forever.” <\/em>A.A. Milne<\/p>\n<p><em>“The boundaries which divide Life from Death are at best shadowy and vague. Who shall say where the one ends, and where the other begins?”<\/em> Edgar Allan Poe<\/p>\n<p>When one spouse dies after meticulously titling assets to pass through joint tenancy to the surviving spouse, estate planning attorneys flinch. There are occasions when everything works smoothly, but they are the exception. As this article from the Santa Cruz Sentinel warns <strong><span style=\"color: #3bb4c9;\"><a style=\"color: #3bb4c9;\" href=\"https:\/\/www.santacruzsentinel.com\/2019\/03\/24\/elder-law-after-husbands-death-wife-needs-to-create-revocable-trust\/\" target=\"_blank\" rel=\"noopener\">“After husband’s death, wife needs to create revocable trust.”<\/a> <\/span><\/strong><em>Actually, she needs more than a revocable trust: she needs an estate plan.<\/em><\/p>\n<p>Most of the assets in the plan created by her husband, in this case, did pass to the wife outside of probate. However, there are a number of details that remain. She needs to obtain date-of-death values for any non-IRA securities the couple owned, and she should also have their home’s value determined, so that a new cost basis for the house will be established. She also needs an appointment with an estate planning attorney to create a will and an estate plan.<\/p>\n<p>If she dies without a will, her children will inherit the estate in equal shares by intestate succession. However, if any of her children pass before she does, the estate could be distributed to her grandchildren. If they are of legal age, there is no control over how the assets will be managed. Making matters worse, if a child or grandchild is disabled and receiving government benefits, an inheritance could make them ineligible for Social Security and Medicaid benefits, unless the inheritance is held within a Special Needs Trust.<\/p>\n<p>These are the basics of an estate plan. They protect loved ones from having to go to court to obtain the power to make decisions on your behalf, as well as protect your family from outsiders making claims on your estate.<\/p>\n<p>A revocable trust is one way to avoid probate. An estate planning attorney will be able to evaluate your own unique situation and determine what the best type of trust would be for your situation, or if you even need a trust.<\/p>\n<p>You may be thinking of putting your home, most families’ biggest asset, into joint tenancy with your children. What if one or more of your children have a divorce, lawsuit or bankruptcy? This will jeopardize your control of your home. A revocable trust will allow your assets to remain in your control.<\/p>\n<p>The last piece in this estate is the IRA. If you are the surviving spouse, you’ll want to roll over your spouse’s IRA into your own. Make sure to update the beneficiary designation. If you neglect this step and<span style=\"color: #3bb4c9;\"><strong> <a style=\"color: #3bb4c9;\" href=\"https:\/\/frankbrunolaw.com\/can-i-correct-an-ira-rmd-mistake\/\" target=\"_blank\" rel=\"noopener\">the IRA pays into your estate when you pass, then the IRA has to be cashed<\/a><\/strong><\/span> in within five years of your death. Your children will lose the opportunity to stretch IRA distributions over their lifetimes.<\/p>\n<p>An estate planning attorney can help guide you through this entire process, working through all the details. <span style=\"color: #3bb4c9;\"><strong><a style=\"color: #3bb4c9;\" href=\"https:\/\/frankbrunolaw.com\/do-i-need-a-living-trust-or-a-will-or-both\/\" target=\"_blank\" rel=\"noopener\">If your goal is to avoid probate<\/a><\/strong><\/span>, they can make that happen, while protecting you and your loved ones at the same time.<\/p>\n<p>Reference<\/p>\n<ul>\n<li><strong>Santa Cruz Sentinel<\/strong> (March 24, 2019) <span style=\"color: #3bb4c9;\"><strong><a style=\"color: #3bb4c9;\" href=\"https:\/\/www.santacruzsentinel.com\/2019\/03\/24\/elder-law-after-husbands-death-wife-needs-to-create-revocable-trust\/\" target=\"_blank\" rel=\"noopener\">“After husband’s death, wife needs to create revocable trust”<\/a><\/strong><\/span><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>“If there ever comes a day when we can’t be together, keep me in your heart. I’ll stay there forever.” A.A. Milne “The boundaries which divide Life from Death are at best shadowy and vague. Who shall say where the one ends, and where the other begins?” Edgar Allan Poe When one spouse dies after<\/p>\n","protected":false},"author":1,"featured_media":1334,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[20,10],"tags":[],"class_list":["post-1333","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-blog","category-elder-law"],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1333","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/comments?post=1333"}],"version-history":[{"count":0,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1333\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media\/1334"}],"wp:attachment":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media?parent=1333"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/categories?post=1333"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/tags?post=1333"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}