{"id":1459,"date":"2022-07-23T10:54:18","date_gmt":"2022-07-23T10:54:18","guid":{"rendered":"https:\/\/mudratcs.com\/frank\/?p=1459"},"modified":"2024-05-27T10:34:36","modified_gmt":"2024-05-27T10:34:36","slug":"we-can-grow-new-brain-cells-well-past-retirement-age","status":"publish","type":"post","link":"https:\/\/frankbrunolaw.com\/we-can-grow-new-brain-cells-well-past-retirement-age\/","title":{"rendered":"We Can Grow New Brain Cells Well Past Retirement Age"},"content":{"rendered":"<p><em>“You have power over your mind—not outside events. Realize this, and you will find strength.”<\/em>—Marcus Aurelius.<\/p>\n<p><em>“The mind of man is capable of anything.” <\/em>—Joseph Conrad.<\/p>\n<p>For many decades, people assumed cognitive decline was inevitable with advanced age. Medical experts said people stopped making new brain cells as adults, so when we lose cells through injury or deterioration, there are no “spare parts” to replace them. As a result, it seemed logical that cognitive impairment was only a matter of time.<\/p>\n<p>The nagging doubt about this theory was the fact we all know people who remain mentally sharp well into their nineties and even past the age of 100. As it turns out, you were not the only one who might have wondered about the accuracy of the long-held assumption of inevitable age-related cognitive decline. A recent study reveals <strong><span style=\"color: #3bb4c9;\"><a style=\"color: #3bb4c9;\" href=\"https:\/\/www.aarp.org\/health\/conditions-treatments\/info-2018\/older-brains-grow-new-cells.html?cmp=EMC-DSO-NLC-RSS---CTRL-112918-P5-3398697&amp;ET_CID=3398697&amp;ET_RID=44279741&amp;mi_u=44279741&amp;mi_ecmp=20181129_DailyBulletin_Control_247401_320001&amp;encparam=bzd27weI0fP7EgKaYxKqXxVSBd1%2bNPEBJKrgq4ge3Bg%3d\" target=\"_blank\" rel=\"noopener\">we can grow new brain cells well past retirement age<\/a>.<\/span><\/strong><\/p>\n<p>Columbia University and the New York State Psychiatric Institute worked together on a study designed to explore this issue. They performed autopsies soon after death on the brains of 28 people ranging in age from 14 to 79. The subjects had all been healthy prior to sudden death. None of them had cognitive impairment during their lives.<\/p>\n<p>The researchers examined the hippocampus area of the brain. The hippocampus processes learning and memory and grows new brain cells to replace those we lose through daily attrition. In particular, the scientists looked at the neurons (nerve cells) and blood vessels within the hippocampus.<\/p>\n<p>Although the brains of the older subjects in the study did not form as many new blood cells and their new neurons might not have been able to make as many connections as the brains of the younger subjects, the study revealed a startling fact. The brains of healthy older people continue making new brain cells, just as well as the brains of younger healthy people.<\/p>\n<p>There was no difference in the volume of new brain cells between the younger and older brains. Since the hippocampus does not stop making new brain cells as long as you stay healthy, the researchers concluded many seniors do not suffer cognitive or emotional decline, despite the common assumption to the contrary.<\/p>\n<p><strong>Take-Aways from the Study Findings<\/strong><\/p>\n<p>Seniors do not get the respect they deserve in American society. One excuse people get for being dismissive of their elders, is the widely held belief that old people become mentally feeble. This research challenges this idea and shows that healthy older people can be just as sharp as people in their youth.<\/p>\n<p>The common belief about seniors having cognitive decline can be a self-fulfilling prophecy. If a person believes cognitive decline is an automatic part of aging, the person might not try to prevent this result. We all know people who suddenly start to act older after they hit a milestone birthday, <a href=\"https:\/\/frankbrunolaw.com\/how-to-decide-who-your-healthcare-proxy-should-be\/\"><strong><span style=\"color: #3bb4c9;\">as if living up to their expectations for a person of that age.<\/span><\/strong><\/a><\/p>\n<p>Now that we know there is no such thing as automatic cognitive decline because of age, we can do something about it. You can stay sharp as long as you stay healthy. Keep learning and reading. Study a foreign language. Do word puzzles. Stay socially active and involved in your community. Take a walk every day to get regular physical exercise. Eat nutritious food.<\/p>\n<p>And above all, avoid things that damage brain cells, particularly the hippocampus. Misusing drugs, even prescription ones, drinking too much alcohol and smoking can all damage the hippocampus. If the hippocampus is not healthy, you will not be able to continue making new brain cells as you age.<\/p>\n<p><em>Reference:<\/em><\/p>\n<p><strong>AARP<\/strong>. <strong><span style=\"color: #3bb4c9;\"><em><a style=\"color: #3bb4c9;\" href=\"https:\/\/www.aarp.org\/health\/conditions-treatments\/info-2018\/older-brains-grow-new-cells.html?cmp=EMC-DSO-NLC-RSS---CTRL-112918-P5-3398697&amp;ET_CID=3398697&amp;ET_RID=44279741&amp;mi_u=44279741&amp;mi_ecmp=20181129_DailyBulletin_Control_247401_320001&amp;encparam=bzd27weI0fP7EgKaYxKqXxVSBd1%2bNPEBJKrgq4ge3Bg%3d\" target=\"_blank\" rel=\"noopener\">“Older Adult Brains Can Grow Thousands of New Cells.”<\/a><\/em> <\/span><\/strong>(accessed May 30, 2019).<\/p>\n","protected":false},"excerpt":{"rendered":"<p>“You have power over your mind—not outside events. Realize this, and you will find strength.”—Marcus Aurelius. “The mind of man is capable of anything.” —Joseph Conrad. For many decades, people assumed cognitive decline was inevitable with advanced age. Medical experts said people stopped making new brain cells as adults, so when we lose cells through<\/p>\n","protected":false},"author":1,"featured_media":1460,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[20],"tags":[],"class_list":["post-1459","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-blog"],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1459","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/comments?post=1459"}],"version-history":[{"count":0,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1459\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media\/1460"}],"wp:attachment":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media?parent=1459"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/categories?post=1459"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/tags?post=1459"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}