{"id":1479,"date":"2022-04-08T11:34:20","date_gmt":"2022-04-08T11:34:20","guid":{"rendered":"https:\/\/mudratcs.com\/frank\/?p=1479"},"modified":"2024-05-27T09:14:47","modified_gmt":"2024-05-27T09:14:47","slug":"spare-your-family-from-a-feud-make-sure-you-have-a-will","status":"publish","type":"post","link":"https:\/\/frankbrunolaw.com\/spare-your-family-from-a-feud-make-sure-you-have-a-will\/","title":{"rendered":"Spare Your Family From a Feud: Make Sure You Have a Will"},"content":{"rendered":"<p>Spare Your Family From a Feud: Make Sure You Have a Will<\/p>\n<p>“The problem with revenge is that it never gets what it wants; it never evens the score. Fairness never comes. The chain reaction set off by every act of vengeance always takes its unhindered course. It ties both the injured and the injurer to an escalator of pain…Why do family feuds go on and on?…the reason is simple: no two people, no two families, ever weigh pain on the same scale.” Lewis B. Smedes<\/p>\n<p>“The family feuds or the village feuds often had to do with an idea of honor. Perhaps it was a peasant idea; perhaps this idea of honor is especially important to a society without recourse to law or without confidence in law.” V. S. Naipaul<\/p>\n<p>If for no other reason than to avoid fracturing the family, as they squabble over who gets Aunt Rosie’s sideboard or Uncle Joe’s collection of baseball cards, everyone needs a will. It is true that having an estate plan created does require us to consider what we want to happen after we have died, which most of us would rather not think about.<\/p>\n<p>However, whether we want to think about it or not, having an estate plan in place, and that includes a will, is a gift of peace we give to our loved ones and ourselves. It’s peace of mind that our family is being told exactly what we want them to do after we pass, and peace of mind to ourselves that we’ve put our plan into place.<\/p>\n<p>A recent article from <em>Fatherly,<\/em> <strong><span style=\"color: #3bb4c9;\"><em><a style=\"color: #3bb4c9;\" href=\"https:\/\/www.fatherly.com\/love-money\/how-to-write-will-tips\/\" target=\"_blank\" rel=\"noreferrer noopener\">“How to Write a Will: 8 Tips Every Parent Needs to Know,”<\/a><\/em> <\/span><\/strong>starts with the basic premise that a will prevents family squabbles. Families fight, when they don’t have clear direction of what the deceased wanted. That’s just one reason to have a last will and testament. However, there are other reasons.<\/p>\n<p>A will is one way to ensure that your property is eventually distributed as you wish. Without a will, your estate is administered as an “intestate estate,” which means the state’s laws will determine who receives your assets after you pass. In some states, that means your spouse gets half of your estate, with your parents getting the rest (if there are no children).<strong><span style=\"color: #3bb4c9;\"> <a style=\"color: #3bb4c9;\" href=\"https:\/\/frankbrunolaw.com\/spare-your-family-from-a-feud-make-sure-you-have-a-will\/\" target=\"_blank\" rel=\"noopener\">If the parents have died<\/a><\/span><\/strong> and there are no children, the rest of the estate may go to your siblings.<\/p>\n<p>Most people—some studies say as many as 60% of Americans—don’t have a will. It’s hard to say why they don’t: maybe they don’t want to accept their own mortality, maybe they don’t understand what will happen when they die without a will, or perhaps they want to wreak havoc on their families. However, having a will is essential.<\/p>\n<p>Don’t delay. If you don’t have a will in place, stop putting it off. Creating a will gives you the opportunity to effectuate your wishes, not that of the state. What if you don’t want your long-lost brother showing up just to receive a portion of your estate? <span style=\"color: #3bb4c9;\"><strong><a style=\"color: #3bb4c9;\" href=\"https:\/\/frankbrunolaw.com\/spare-your-family-from-a-feud-make-sure-you-have-a-will\/\" target=\"_blank\" rel=\"noopener\">How about if your ex-wife remains the beneficiary of your IRA?<\/a> <\/strong><\/span> If you don’t want someone to receive any of your assets, you need to have a will. Otherwise, there’s no way to know how the distribution will play out.<\/p>\n<p>Be thoughtful about how you distribute your assets. If you have children and your will gives them your assets when they reach 18, will they be prepared to manage without blowing their inheritance in a month? A qualified estate planning attorney will be able to help you create a plan for distributing your wealth to children or other heirs in a sequence that will match their financial abilities. You may want to create a trust that will hold the assets, with a trustee who can ensure that assets are distributed in a wise and timely manner.<\/p>\n<p>Every family is different, and today’s families, which often include children from prior marriages, require special planning. If you have remarried and have not legally adopted your spouse’s children from a previous marriage, they are not your legal heirs. If you want to make sure they inherit money or a specific asset, you’ll need to state that clearly in your will. If you are not married to your partner, they will not have any rights to your estate, unless a will is created that directs the assets you want them to inherit.<\/p>\n<p>Parents of young children absolutely need a will. If you do not, and both parents pass away at the same time, their future will be determined by the court. They could end up in foster care, while awaiting a court decision. Battling grandparents may create a tumultuous situation. The court could also name a guardian who you would never have chosen. <strong><span style=\"color: #3bb4c9;\"><a style=\"color: #3bb4c9;\" href=\"https:\/\/frankbrunolaw.com\/using-trusts-to-maintain-control-of-inheritances\/\" target=\"_blank\" rel=\"noopener\">A will or trust lets you decide.<\/a><\/span><\/strong><\/p>\n<p>Speak with an estate planning attorney to make sure you have a will that is properly prepared and follows the laws of your state. You also want to have a power of attorney and a health care agent named. Having these plans made before you need them, gives you the ability to express your wishes in a way that can be legally enforced.<\/p>\n<p><em>Reference<\/em>: <strong>Fatherly <\/strong>(Feb. 6, 2019) <span style=\"color: #3bb4c9;\"><strong><em><a style=\"color: #3bb4c9;\" href=\"https:\/\/www.fatherly.com\/love-money\/how-to-write-will-tips\/\" target=\"_blank\" rel=\"noreferrer noopener\">“How to Write a Will: 8 Tips Every Parent Needs to Know”<\/a><\/em><\/strong><\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Spare Your Family From a Feud: Make Sure You Have a Will “The problem with revenge is that it never gets what it wants; it never evens the score. Fairness never comes. The chain reaction set off by every act of vengeance always takes its unhindered course. It ties both the injured and the injurer<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[20,17],"tags":[],"class_list":["post-1479","post","type-post","status-publish","format-standard","hentry","category-blog","category-will-contest"],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1479","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/comments?post=1479"}],"version-history":[{"count":0,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1479\/revisions"}],"wp:attachment":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media?parent=1479"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/categories?post=1479"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/tags?post=1479"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}