{"id":1502,"date":"2022-03-14T04:46:00","date_gmt":"2022-03-14T04:46:00","guid":{"rendered":"https:\/\/mudratcs.com\/frank\/?p=1502"},"modified":"2024-05-27T07:24:28","modified_gmt":"2024-05-27T07:24:28","slug":"what-a-durable-power-of-attorney-can-do","status":"publish","type":"post","link":"https:\/\/frankbrunolaw.com\/what-a-durable-power-of-attorney-can-do\/","title":{"rendered":"What a Durable Power of Attorney Can Do?"},"content":{"rendered":"<p>“Make sure you visualize what you really want, not what someone else wants for you.” Jerry Gillies<\/p>\n<p>“No one is useless in this world who lightens the burdens of another.” Charles Dickens<\/p>\n<p>Helping aging parents with daily tasks can become a challenge, if the parent has limited mobility. A trip to the bank, for example, will require coordinating the adult child’s responsibilities with the aging parent’s limitations. If the parent has more energy in the morning, for instance, but the adult child is working, this can become a bigger challenge than if the adult child can go to the bank on behalf of the parent, when it’s convenient for them — at a lunch break, for instance.<\/p>\n<p>In this situation, as noted in The Daily Sentinel’s article “Tools to help your aging parent,” having a durable power of attorney will help. This type of power of attorney is a legal document that permits a child or other named individual to handle certain responsibilities, like banking. Granting a power of attorney to a child doesn’t mean giving up total control, which is often a concern of aging parents. It simply means that the child is now legally allowed to handle these tasks.<\/p>\n<p>What a Durable Power of Attorney Can Do? A durable power of attorney is different than the “general medical power of attorney.” As implied by its name, this is limited to making decisions about the parent’s health care and is usually used only when the parent is not able to make these decisions on their own.<\/p>\n<p>There are more serious situations, where neither of these types of power of attorney is enough, such as when the parent lacks capacity because of dementia or a medical decision. It is necessary to protect the parent from themselves or anyone who might try to take advantage of their lack of clear mental capacity. This may require that an adult child needs to be appointed as a guardian for their parent.<\/p>\n<p>Being appointed a guardian can be a very emotional event, since the parent and child are not just switching emotional roles, but legal roles. The parent no longer has the capacity to make significant decisions, because a court has found that they no longer have that ability.<\/p>\n<p>You may have heard the term “conservatorship” used. It is similar to guardianship, except that the conservatorship only allows for control over the parent’s financial affairs.<\/p>\n<p>Guardianship is taken very seriously, as it should be. This removes an adult’s right to make any kind of decision on their own. In some states, including Colorado, the court must first be convinced that the parent is unable to effectively receive or evaluate information or to make or communicate decisions. They must be deemed incapacitated, before guardianship can be established. Once that standard has been met, then guardianship is established. If there is a doubt about incapacity, then no guardianship will be established, and the family is faced with finding other ways to help the aging parent.<\/p>\n<p>What a Durable Power of Attorney Can Do is allow parents and their children to face many issues that are best addressed before incapacity becomes an issue. If the family does not have a plan for the aging parent’s care, it is recommended that the family make an appointment with an estate planning attorney to discuss the various options.<\/p>\n<p><em>Reference: The Daily Sentinel (March 24, 2019) <strong><span style=\"color: #3ab3c7;\"><a style=\"color: #3ab3c7;\" href=\"https:\/\/www.gjsentinel.com\/news\/business\/tools-to-help-your-aging-parent\/article_db8e4622-4df9-11e9-a22c-20677ce85d90.html\" target=\"_blank\" rel=\"noopener\">“Tools to help your aging parent”<\/a><\/span><\/strong><\/em><\/p>\n<p><em>RELATED ARTICLES:<\/em><\/p>\n<ul>\n<li><strong><span style=\"color: #3ab3c7;\"><em><a style=\"color: #3ab3c7;\" href=\"https:\/\/www.gjsentinel.com\/news\/business\/tools-to-help-your-aging-parent\/article_db8e4622-4df9-11e9-a22c-20677ce85d90.html\" target=\"_blank\" rel=\"noopener\">“Tools to help your aging parent,”<\/a><\/em><\/span><\/strong><\/li>\n<li><span style=\"color: #3ab3c7;\"><a style=\"color: #3ab3c7;\" href=\"https:\/\/frankbrunolaw.com\/is-a-revocable-trust-valuable-in-estate-planning\/\" target=\"_blank\" rel=\"noopener\"><strong><em>Guardianship is taken very seriously, as it should be<\/em><\/strong><\/a><\/span><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>“Make sure you visualize what you really want, not what someone else wants for you.” Jerry Gillies “No one is useless in this world who lightens the burdens of another.” Charles Dickens Helping aging parents with daily tasks can become a challenge, if the parent has limited mobility. A trip to the bank, for example,<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[20,12],"tags":[],"class_list":["post-1502","post","type-post","status-publish","format-standard","hentry","category-blog","category-guardianship"],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1502","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/comments?post=1502"}],"version-history":[{"count":0,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1502\/revisions"}],"wp:attachment":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media?parent=1502"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/categories?post=1502"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/tags?post=1502"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}