{"id":1506,"date":"2022-03-18T04:51:08","date_gmt":"2022-03-18T04:51:08","guid":{"rendered":"https:\/\/mudratcs.com\/frank\/?p=1506"},"modified":"2024-05-23T10:36:12","modified_gmt":"2024-05-23T10:36:12","slug":"parents-want-their-children-to-be-taken-care-of-after-they-die","status":"publish","type":"post","link":"https:\/\/frankbrunolaw.com\/parents-want-their-children-to-be-taken-care-of-after-they-die\/","title":{"rendered":"Parents Want Their Children To Be Taken Care Of After They Die"},"content":{"rendered":"<p>There are many legal strategies involved in estate planning, including wills, revocable living trusts, irrevocable trusts, durable powers of attorney, and health care documents. New clients often say that they do not have an estate plan. Most people are surprised to learn that they actually do have a plan. In the absence of legal planning otherwise, their estate will be distributed after death according to New York’s laws of intestacy. Of course, this may not be the plan they would have chosen. A properly drafted estate plan will replace the terms of the New York’s estate plan with your own. Reach out to your local Queens County estate planning attorney to create your estate plan.<\/p>\n<p>MORE ABOUT ESTATE PLANNING SERVICES:<\/p>\n<p><strong>YOUR LAST WILL AND TESTAMENT <\/strong>– Your last will and testament is just one part of a comprehensive estate plan. If a person dies without a Will they are said to have died “intestate” and state laws will determine how and to whom the person’s assets will be distributed. Some things you should know about wills:<\/p>\n<p>A will has no legal authority until after death. So, a will does not help manage a person’s affairs when they are incapacitated, whether by illness or injury.<\/p>\n<p>A will does not help an estate avoid probate. A will is the legal document submitted to the probate court, so it is basically an “admission ticket” to probate.<\/p>\n<p>A will is a good place to nominate the guardians (or back-up parents) of your minor children if they are orphaned. All parents of minor children should document their choice of guardians. If you leave this to chance, you could be setting up a family battle royal, and your children could end up with the wrong guardians.<\/p>\n<p><strong>TRUSTS: REVOCABLE LIVING TRUSTS, IRREVOCABLE TRUSTS, TESTAMENTARY TRUSTS, SPECIAL NEEDS TRUSTS, ETC. <\/strong>– Trusts come in many “flavors,” they can be simple or complex, and serve a variety of legal, personal, investment or tax planning purposes. At the most basic level, a trust is a legal entity with at least three parties involved: the trust-maker, the trustee (trust manager), and the trust beneficiary. Oftentimes, all three parties are represented by one person or a married couple. In the case of a revocable living trust, for example, a person may create a trust (the trust-maker) and name themselves the current trustees (trust managers) who manage the trust assets for their own benefit (trust beneficiary).<\/p>\n<p>Depending on the situation, there may be many advantages to establishing a trust, including avoiding probate court. In most cases, assets owned in a revocable living trust will pass to the trust beneficiaries (or heirs) immediately upon the death of the trust-maker(s) with no probate required. Certain trusts also may result in tax advantages both for the trust-maker and the beneficiary. Or they may be used to protect property from creditors, or simply to provide for someone else to manage and invest property for the trust-maker(s) and the named beneficiaries. If well drafted, another advantage of trusts is their continuing effectiveness even if the trust-maker dies or becomes incapacitated.<\/p>\n<p><strong>POWERS OF ATTORNEY <\/strong>– A power of attorney is a legal document giving another person (the attorney-in-fact) the legal right (powers) to do certain things for you. What those powers are depends on the terms of the document. A power of attorney may be very broad or very limited and specific. All powers of attorney terminate upon the death of the maker, and may terminate when the maker (principal) becomes incapacitated (unable to make or communicate decisions). When the intent is to designate a back-up decision-maker in the event of incapacity, then a durable power of attorney should be used. Durable Powers of Attorney should be frequently updated because banks and other financial institutions may hesitate to honor a power of attorney that is more than a year old.<\/p>\n<p><strong>HEALTH CARE DOCUMENTS (OR ADVANCE DIRECTIVES) <\/strong>– An advance directive is a document that specifies the type of medical and personal care you would want should you lose the ability to make and communicate your own decisions. Anyone over the age of 18 may execute an advance directive, and this document is legally binding in NY. Your advance directive can specify who will make and communicate decisions for you, and it can set out the circumstances under which you would not like your life to be prolonged if, for example, you were in a coma with no reasonable chance of recovery.<\/p>\n<p>A document that goes hand-in-hand with your advance directive is an authorization to your medical providers to allow specified individuals to access your medical information. Without this authorization, your doctor may refuse to communicate with your hand-picked decision maker.<\/p>\n<p>References:<\/p>\n<ul>\n<li><span style=\"color: #3ab3c7;\"><a style=\"color: #3ab3c7;\" href=\"https:\/\/frankbrunolaw.com\/estate-planning-attorney-nyc\/\" target=\"_blank\" rel=\"noopener\"><strong><em>Bruno Reyes Law Estate Planning Attorney<\/em><\/strong><\/a><\/span><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>There are many legal strategies involved in estate planning, including wills, revocable living trusts, irrevocable trusts, durable powers of attorney, and health care documents. New clients often say that they do not have an estate plan. Most people are surprised to learn that they actually do have a plan. In the absence of legal planning<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[20,12],"tags":[],"class_list":["post-1506","post","type-post","status-publish","format-standard","hentry","category-blog","category-guardianship"],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1506","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/comments?post=1506"}],"version-history":[{"count":0,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1506\/revisions"}],"wp:attachment":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media?parent=1506"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/categories?post=1506"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/tags?post=1506"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}