{"id":1525,"date":"2022-03-22T05:39:19","date_gmt":"2022-03-22T05:39:19","guid":{"rendered":"https:\/\/mudratcs.com\/frank\/?p=1525"},"modified":"2024-05-27T08:39:23","modified_gmt":"2024-05-27T08:39:23","slug":"how-the-ancient-ones-handled-their-estate-planning","status":"publish","type":"post","link":"https:\/\/frankbrunolaw.com\/how-the-ancient-ones-handled-their-estate-planning\/","title":{"rendered":"How The Ancient Ones Handled Their Estate Planning"},"content":{"rendered":"<p>“I love money. I love everything about it. I bought some pretty good stuff. Got me a $300 pair of socks. Got a fur sink. An electric dog polisher. A gasoline powered turtleneck sweater. And, of course, I bought some dumb stuff, too.” Steve Martin.<\/p>\n<p>“I made my money the old-fashioned way. I was very nice to a wealthy relative right before he died.” Malcolm Forbes.<\/p>\n<p>It’s not unusual for a family member to find an old bank account or painting, years after someone has passed and the estate has been closed. If it’s not something of great value, says Above the Law in the article <strong><span style=\"color: #3ab3c7;\"><em><a style=\"color: #3ab3c7;\" href=\"https:\/\/abovethelaw.com\/2019\/03\/old-money-same-issues-lessons-from-the-5th-century-in-organizing-your-estate\/\" target=\"_blank\" rel=\"noopener\">“Old Money, Same Issues: Lessons from the 5th Century in Organizing Your Estate,”<\/a><\/em><\/span><\/strong> it’s easy to handle. Contacting a few members of the family to see who wants a small item, can be a simple task.<\/p>\n<p>However, if it’s of high value, the family may need to petition a bank, the probate court or even an unclaimed funds bureau for access to the asset, so it can be distributed to beneficiaries or heirs. The testator needs to appoint a meticulous administrator so no stone is left unturned, when the time comes for marshalling all of the assets, before the estate can be closed.<\/p>\n<p>Israeli archeologists recently unearthed deeply buried stones related to the estate of an ancient Samaritan named Adios. The stone had an inscription that read “Only God help the beautiful property of Master Adios, amen.” The estate is reported to date back 1,600 years to the 5th century. The estate contained stone mechanisms for making wine, flour and oil, including a mill. It was fairly well organized.<\/p>\n<p>We have now organized people who take care of their heirs and beneficiaries, by listing all of their assets and taking the time to have an estate plan created that includes a detailed will, among <a href=\"https:\/\/frankbrunolaw.com\/why-do-i-need-an-executor\/\" target=\"_blank\" rel=\"noopener\"><strong><span style=\"color: #3ab3c7;\"><em>other important documents<\/em>.<\/span><\/strong><\/a> We are centuries away from inscribed stones, but the game plan is the same: write down the assets, have a will that details what assets go to either people or charitable organizations and prepare for the future.<\/p>\n<p>If there is no list of assets, there are ways to uncover them. However, it creates a lot of work for the executor and stress for the family, that could be avoided with an estate plan.<\/p>\n<p>The best evidence of asset holdings are often a decedent’s tax returns. General supporting documentation can reveal useful information about a person’s financial status. A look at a decedent’s paper files can reveal bank accounts, investment accounts and insurance policies.<\/p>\n<p>If the assets are not properly documented in an estate plan, the monies may end up in a state’s unclaimed funds depository. Real estate, if taxes are not paid, may be seized. Many of the concerns for unclaimed funds can be addressed, by taking the time to create a spreadsheet of information and sharing it with the executor.<\/p>\n<p>Whether your assets include a stone mill or bank accounts, how the ancient ones handled their estate planning may in fact be different than a modern American. An estate plan that includes clear and organized information about your assets will increase the likelihood that your assets will be distributed and not disappear, until they are uncovered centuries later.<\/p>\n<p>Related Articles:  <strong><span style=\"color: #3ab3c7;\"><em><a style=\"color: #3ab3c7;\" href=\"https:\/\/abovethelaw.com\/2019\/03\/old-money-same-issues-lessons-from-the-5th-century-in-organizing-your-estate\/\" target=\"_blank\" rel=\"noopener\">“Old Money, Same Issues: Lessons from the 5th Century in Organizing Your Estate,”<\/a><\/em><\/span><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>“I love money. I love everything about it. I bought some pretty good stuff. Got me a $300 pair of socks. Got a fur sink. An electric dog polisher. A gasoline powered turtleneck sweater. And, of course, I bought some dumb stuff, too.” Steve Martin. “I made my money the old-fashioned way. I was very<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[20,14],"tags":[],"class_list":["post-1525","post","type-post","status-publish","format-standard","hentry","category-blog","category-probate"],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1525","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/comments?post=1525"}],"version-history":[{"count":0,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1525\/revisions"}],"wp:attachment":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media?parent=1525"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/categories?post=1525"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/tags?post=1525"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}