{"id":1529,"date":"2022-02-23T05:48:55","date_gmt":"2022-02-23T05:48:55","guid":{"rendered":"https:\/\/mudratcs.com\/frank\/?p=1529"},"modified":"2024-05-27T10:03:42","modified_gmt":"2024-05-27T10:03:42","slug":"a-big-red-binder-of-information","status":"publish","type":"post","link":"https:\/\/frankbrunolaw.com\/a-big-red-binder-of-information\/","title":{"rendered":"A Big Red Binder of Information"},"content":{"rendered":"<p>Life happens, when we’re not prepared. A woman is recovering at home from minor surgery when her older sister dies unexpectedly, thousands of miles away. She can’t fly from her home to her sister’s home for weeks. What will happen, asks Considerable in the article <a href=\"https:\/\/www.hellalife.com\/blog\/family\/do-this-for-people-who-love-you\/\" target=\"_blank\" rel=\"noopener\"><strong><span style=\"color: #3ab3c7;\"><em>“This is the most helpful thing you can do for the people who love you”<\/em><\/span><\/strong> <\/a>? If you’re not prepared, the result is a mess for those you love.<\/p>\n<p>The task of untangling someone’s financial responsibilities and their legal matters is emotionally and mentally draining, when they have not prepared any kind of plan to convey the information. It’s not just making the calls and explaining who you are and why you are calling but having to constantly be starting at the death certificate of someone you love. That’s why people should consider making themselves a Big Red Binder.<\/p>\n<p>That’s the name many people give to their folder of names and numbers and important documents that are assembled for such an occurrence, a reference book for their lives that contains every bit of information that their loved ones will need, in the event of a sudden death or illness.<\/p>\n<p>It’s admittedly old school, but there are advantages to using a large three-ring binder. You can put documents in pocket pages and use loose-leaf paper for your important information. Consider going whole-hog and also buying dividers—anything you can do to make it easier for the person who is going to have to tackle all of these tasks.<\/p>\n<p>Don’t rely on digital only: if your family can’t get into your computer or access your cloud storage, they won’t be able to help. You could keep a copy of the information in a secure location in the cloud or on your computer, in addition to on paper.<\/p>\n<p>Tell at least two people about the Big Red Binder of Information and let them where you have located it. If possible, give one of them a copy, so that they have it available. This is what you should include in it:<\/p>\n<p><strong>Medical Information<\/strong>: Include surgeries, medications, recent test results, treatments and the name and contact information of healthcare providers.<\/p>\n<p><strong>Health Insurance Info<\/strong>: The name of the company, a copy of your health insurance card, your Medicare card and any recent bills.<\/p>\n<p><strong>Recurring Bills<\/strong>: Recent bills and contact information about your mortgage payments or rent, utilities, car lease or loan and life insurance policies. You should do the same for regular bills and for subscriptions, memberships.<\/p>\n<p><strong>Insurance Contacts<\/strong>: A list of all insurance agents, policy numbers and the agent’s contact information.<\/p>\n<p><strong>Investment Information<\/strong>: Your financial adviser’s contact information and account numbers.<\/p>\n<p><strong>Financial and Legal Information<\/strong>: Contact information for your estate planning attorney and your CPA. I t should include where your prior year’s tax records can be found. Make a copy of the front and back of your credit and bank cards. Include recent credit card bills and note when payments are generally due.<\/p>\n<p><strong>Pet Care<\/strong>: Contact info for the vet, any medication information and info for a trusted friend who can care for a pet on a short-term basis. A pet trust, if you have one.<\/p>\n<p><strong>Personal Lists<\/strong>: Who should be notified in the event of a serious illness or death? A list of names, phone numbers and email addresses will be invaluable.<\/p>\n<p>A personal binder like this relieves children or friends, who are in probably still in shock, and gives them the ability to have the information they need right at their fingertips, without having to dig through files or drawers of paper. It’s a gift to those you love.<\/p>\n<p>Reference:<\/p>\n<ul>\n<li>Reference: <strong>Considerable<\/strong> (April 19, 2019) <strong><span style=\"color: #3ab3c7;\"><em>“<a style=\"color: #3ab3c7;\" href=\"https:\/\/www.hellalife.com\/blog\/family\/do-this-for-people-who-love-you\/\" target=\"_blank\" rel=\"noopener\">This is the most helpful thing you can do for the people who love you”<\/a><\/em><\/span><\/strong><\/li>\n<\/ul>\n<p>Related Articles<\/p>\n<ul>\n<li><strong><span style=\"color: #3ab3c7;\"><a style=\"color: #3ab3c7;\" href=\"https:\/\/www.hellalife.com\/blog\/family\/do-this-for-people-who-love-you\/\" target=\"_blank\" rel=\"noopener\"><em>“This is the most helpful thing you can do for the people who love you”?<\/em><\/a><\/span><\/strong><\/li>\n<li><a href=\"https:\/\/frankbrunolaw.com\/digital-assets-in-estate-planning-the-brave-new-world-of-estate-planning\/\"><span style=\"color: #3ab3c7;\"><strong><em>access your cloud storage<\/em><\/strong><\/span><\/a><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Life happens, when we’re not prepared. A woman is recovering at home from minor surgery when her older sister dies unexpectedly, thousands of miles away. She can’t fly from her home to her sister’s home for weeks. What will happen, asks Considerable in the article “This is the most helpful thing you can do for the<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[20,14],"tags":[],"class_list":["post-1529","post","type-post","status-publish","format-standard","hentry","category-blog","category-probate"],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1529","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/comments?post=1529"}],"version-history":[{"count":0,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1529\/revisions"}],"wp:attachment":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media?parent=1529"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/categories?post=1529"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/tags?post=1529"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}