{"id":1609,"date":"2022-03-13T04:44:45","date_gmt":"2022-03-13T04:44:45","guid":{"rendered":"https:\/\/mudratcs.com\/frank\/?p=1609"},"modified":"2024-05-27T10:59:15","modified_gmt":"2024-05-27T10:59:15","slug":"someday-is-sooner-than-you-think","status":"publish","type":"post","link":"https:\/\/frankbrunolaw.com\/someday-is-sooner-than-you-think\/","title":{"rendered":"Someday’ Is Sooner than You Think"},"content":{"rendered":"<p>If you and your siblings have been worrying about older parents please understand that ‘someday’ is sooner than you think.<\/p>\n<p>The cause for sleepless nights for many, now comes from worrying about older parents. As parents age, it becomes more important to talk with them about a number of “someday” issues, advises Kanawha Metro in the article <em>“<strong><span style=\"color: #3ab3c7;\"><a style=\"color: #3ab3c7;\" href=\"https:\/\/www.wvgazettemail.com\/metrokanawha\/diane-tarantini-preparing-for-someday\/article_1fab2925-4c79-572e-ba63-addc658fa67c.html\" target=\"_blank\" rel=\"noreferrer noopener\">Preparing for someday<\/a>.<\/span><\/strong>” As their lives move into the elder years, your discussions will need to address housing, finances and end-of-life wishes.<\/em><\/p>\n<p>Where do your parents want to spend their later years? It may be that they want to move to an active retirement community not far from where they live now, or they may want a complete change of scenery, perhaps in a warmer climate.<\/p>\n<p>One family made arrangements for their mother to take a tour of a nearby senior-living community, after their father passed. By showing their mother the senior-living community, they made an unknown, slightly intimidating thing into a familiar and attractive possibility. Because she saw the facility with no pressure, just a tour and lunch, she knew what kind of options it presented. The building was clean and pretty, and the staff was friendly. Therefore, it was a positive experience. She was able to picture herself living there.<\/p>\n<p>Money becomes an issue, as parents age. If the person who always handled the family finances passes away, often the surviving spouse is left trying to figure out what has been done for the last five decades. A professional can help, especially if they have had a long-standing relationship.<\/p>\n<p>However, when illness or an injury takes the surviving spouse out of the picture, even for a little while, things can get out of control fast. It only takes a few weeks of not being able to write checks or manage finances, to demonstrate the wisdom of having children or a trusted person named with a power of attorney to be able to pay bills and manage the household.<\/p>\n<p>As parents age and their health becomes fragile, they need help with doctor appointments. Having a child or trusted adult go with them to speak up on their behalf, or explain any confusing matters, is very important.<\/p>\n<p>Having an estate plan in place is another part of the business of aging that needs to be accomplished. It may be helpful to go with your parents to meet with an estate planning attorney to create documents that include a last will and testament, durable power of attorney and advanced health care directive. Without these documents, executing their estate or helping them if they become incapacitated will be more complex, and more costly.<\/p>\n<p><em><span style=\"color: #3ab3c7;\"><a style=\"color: #3ab3c7;\" href=\"https:\/\/frankbrunolaw.com\/how-do-i-get-my-moms-affairs-in-order\/\" target=\"_blank\" rel=\"noopener\"><strong>Eliminate a scavenger<\/strong><\/a><\/span> hunt by making sure that at least two siblings know where the originals of these documents are.<\/em><\/p>\n<p>One of the more difficult conversations has to do with end-of-life and funeral arrangements. Where do your parents want to be buried, or do they want to be cremated? What should be done with their remains?<\/p>\n<p>What do they want to be done with their personal belongings? Are there certain items that they want to be given to certain members of the family, or other people they care for? One family used masking tape and a marker to write the names of the people they <span style=\"color: #3ab3c7;\"><a style=\"color: #3ab3c7;\" href=\"https:\/\/frankbrunolaw.com\/is-a-revocable-trust-valuable-in-estate-planning\/\" target=\"_blank\" rel=\"noopener\"><strong><em>wanted to receive certain items<\/em>.<\/strong><\/a><\/span><\/p>\n<p>Finally, what do they want to happen to their pets? If there is a family member who says they will take their parent’s pet, can that person be trusted to follow through? There needs to be a Plan A, Plan B and Plan C so that the beloved pet can be assured a long and comfortable life after their owner has passed.<\/p>\n<p>Yes, these are difficult conversations. However, not having them can lead to far more difficult issues. Knowing what your loved ones wish to happen, and making it enforceable with an estate plan, provides everyone in the family with peace of mind.<\/p>\n<p><em>Related Articles:<\/em><\/p>\n<ul>\n<li><strong><span style=\"color: #3ab3c7;\"><em><a style=\"color: #3ab3c7;\" href=\"https:\/\/www.wvgazettemail.com\/metrokanawha\/diane-tarantini-preparing-for-someday\/article_1fab2925-4c79-572e-ba63-addc658fa67c.html\" target=\"_blank\" rel=\"noopener\">“Preparing for someday”<\/a><\/em><\/span><\/strong><\/li>\n<li><span style=\"color: #3ab3c7;\"><a style=\"color: #3ab3c7;\" href=\"https:\/\/frankbrunolaw.com\/how-do-i-get-my-moms-affairs-in-order\/\" target=\"_blank\" rel=\"noopener\"><strong><em>“Eliminate a scavenger hunt”<\/em><\/strong><\/a><\/span><\/li>\n<li><span style=\"color: #3ab3c7;\"><a style=\"color: #3ab3c7;\" href=\"https:\/\/frankbrunolaw.com\/is-a-revocable-trust-valuable-in-estate-planning\/\" target=\"_blank\" rel=\"noopener\"><strong><em>Is a Revocable Trust Valuable in Estate Planning?<\/em><\/strong><\/a><\/span><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>If you and your siblings have been worrying about older parents please understand that ‘someday’ is sooner than you think. The cause for sleepless nights for many, now comes from worrying about older parents. As parents age, it becomes more important to talk with them about a number of “someday” issues, advises Kanawha Metro in<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[20],"tags":[],"class_list":["post-1609","post","type-post","status-publish","format-standard","hentry","category-blog"],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1609","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/comments?post=1609"}],"version-history":[{"count":0,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1609\/revisions"}],"wp:attachment":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media?parent=1609"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/categories?post=1609"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/tags?post=1609"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}