{"id":1617,"date":"2022-03-19T04:54:15","date_gmt":"2022-03-19T04:54:15","guid":{"rendered":"https:\/\/mudratcs.com\/frank\/?p=1617"},"modified":"2024-05-27T11:42:23","modified_gmt":"2024-05-27T11:42:23","slug":"kids-grown-up-protect-them-with-these-three-documents","status":"publish","type":"post","link":"https:\/\/frankbrunolaw.com\/kids-grown-up-protect-them-with-these-three-documents\/","title":{"rendered":"Kids Grown Up? Protect Them with These Three Documents"},"content":{"rendered":"<p>Kids Grown Up? Protect Them with These Three Documents<\/p>\n<p>“Right is right even if no one is doing it; wrong is wrong even if everyone is doing it.”  Saint Augustine of Hippo<\/p>\n<p>“Everybody knows how to raise children except for the people that have them.” P.J. O’Rourke<\/p>\n<p>Without the right documents in place, you do not have the legal right to protect your own children, once they turn 18, says <em>The National Law Review<\/em> in an unsettling but must-read article titled <strong><span style=\"color: #3ab3c7;\"><em><a style=\"color: #3ab3c7;\" href=\"https:\/\/www.natlawreview.com\/article\/three-critical-legal-documents-every-parent-should-get-place-now-to-safeguard-their\" target=\"_blank\" rel=\"noreferrer noopener\">“Three Critical Legal Documents Every Parent Should Get in Place Now to Safeguard Their Adult Children.”<\/a><\/em><\/span><\/strong><\/p>\n<p>There are only three documents and they are fairly straightforward. There is no reason not to have them in place. If your adult child was incapacitated by an accident or an illness, you would want to speak with the medical staff to find out how they are and what decisions need to be made. Whether you were making a phone call or arriving at the hospital, a nurse or doctor would not be permitted to speak with you about your own adult child’s condition or be involved with making any medical decisions.<\/p>\n<p>It sounds unreasonable, and perhaps it is, but that is the law. There are steps you can take to ensure that you are not in this situation.<\/p>\n<p>HIPAA Authorization Form gives you the authority to speak with healthcare providers. This is a federal law (Health Insurance Portability and Accountability Act of 1996) that safeguards who can access an adult’s private health data. HIPAA prevents healthcare providers from revealing any information to you or anyone else about a patient’s status. The practitioners could face severe penalties for violating HIPAA.<\/p>\n<p>This is why you want to have a <strong>HIPAA authorization <\/strong>signed by your adult child and naming you as an authorized recipient.  This will give you the ability to ask for and receive information about your child’s health status, progress and treatment. This is especially important, if your child is unconscious or in an unresponsive state. The alternative? Going to court. That’s not what you want to be doing during a health emergency.<\/p>\n<p>A <strong>Healthcare Power of Attorney<\/strong> or health care proxy needs to be in place, so you can be named his or her “medical agent” and have the ability to view their medical records and make informed decisions on their behalf. Without this (or a court-appointed guardianship), healthcare decisions will be in the hands of healthcare providers only. That’s not a bad thing, if you implicitly trust your child’s doctor. However, if your child is incapacitated in an out-of-town hospital with healthcare providers you don’t know, you will want to be able to make decisions on his or her behalf.<\/p>\n<p>Note that physicians prefer a single medical agent, not a handful. The concern is that if time is a critical factor and a group of family members do not agree on care, it may compromise the healthcare services that can be provided. You can name multiple agents in priority order. A mother might be listed as the medical agent, and if she is unable or unwilling to serve, the second person would be the father.<\/p>\n<p>The third document is a <strong>General Power of Attorney.<\/strong> This would give you the right to make financial decisions on your child’s behalf, if they were to become incapacitated. You would have the legal right to manage bank accounts, pay bills, sign tax returns, apply for government benefits, break or apply a lease and conduct activities on behalf of your child. <span style=\"color: #3ab3c7;\"><a style=\"color: #3ab3c7;\" href=\"https:\/\/frankbrunolaw.com\/kids-grown-up-protect-them-with-these-three-documents\/\" target=\"_blank\" rel=\"noopener\"><strong>Without this document<\/strong><\/a><\/span><a href=\"https:\/\/www.frankbrunolaw.com\/kids-grown-up-protect-them-with-these-three-documents\/#\">,<\/a> you won’t be able to help your child without a court-appointed guardianship.<\/p>\n<p>Keep in mind that these documents need to be updated every few years. If you try to use an older document, the bank or hospital may not accept them. Your adult child also has the ability to revoke these documents at any time, just by saying they revoke them or by putting it in writing. If you have an adult child living out of state, you want to have these documents prepared for your home state and their state of residence.<\/p>\n<p>Finally, this is not a time to download forms and hope for the best. An estate planning attorney will know more specifically what forms are used in your state and help you make sure that they are prepared correctly.<\/p>\n<p><em>Reference:<\/em> <strong>The National Law Review<\/strong> (Feb. 11, 2019) <strong><span style=\"color: #3ab3c7;\"><em><a style=\"color: #3ab3c7;\" href=\"https:\/\/www.natlawreview.com\/article\/three-critical-legal-documents-every-parent-should-get-place-now-to-safeguard-their\" target=\"_blank\" rel=\"noreferrer noopener\">“Three Critical Legal Documents Every Parent Should Get in Place Now to Safeguard Their Adult Children”<\/a><\/em><\/span><\/strong><\/p>\n<p>Have your kids Grown Up? Protect Them with These Three Documents: <span style=\"color: #3ab3c7;\"><a style=\"color: #3ab3c7;\" href=\"https:\/\/frankbrunolaw.com\/what-are-the-must-have-estate-planning-documents\/\" target=\"_blank\" rel=\"noopener\"><strong>HIPPA authorization, health care proxy, General Power of Attorney.<\/strong><\/a><\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Kids Grown Up? Protect Them with These Three Documents “Right is right even if no one is doing it; wrong is wrong even if everyone is doing it.”  Saint Augustine of Hippo “Everybody knows how to raise children except for the people that have them.” P.J. O’Rourke Without the right documents in place, you do not<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[20],"tags":[],"class_list":["post-1617","post","type-post","status-publish","format-standard","hentry","category-blog"],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1617","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/comments?post=1617"}],"version-history":[{"count":0,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1617\/revisions"}],"wp:attachment":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media?parent=1617"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/categories?post=1617"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/tags?post=1617"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}