{"id":1651,"date":"2022-02-27T08:43:47","date_gmt":"2022-02-27T08:43:47","guid":{"rendered":"https:\/\/mudratcs.com\/frank\/?p=1651"},"modified":"2024-05-23T10:33:04","modified_gmt":"2024-05-23T10:33:04","slug":"heres-how-you-know-youre-an-adult-10-documents","status":"publish","type":"post","link":"https:\/\/frankbrunolaw.com\/heres-how-you-know-youre-an-adult-10-documents\/","title":{"rendered":"Here’s How You Know You’re an Adult: 10 Documents"},"content":{"rendered":"<p>Fifty is a little on the late side to start taking care of these important life matters. However, it is better late than never. It’s easy to put these tasks off, since the busyness of our day-to-day lives gives us a good reason to procrastinate on the larger issues, like death and our own mortality. However, according to Charlotte Five’s article <strong><span style=\"color: #3ab3c7;\"><em><a style=\"color: #3ab3c7;\" href=\"https:\/\/www.charlottefive.com\/10-documents-future-planning\/\" target=\"_blank\" rel=\"noopener\">“For ultimate adulting status, have these 10 documents by the time you’re 35,”<\/a><\/em><\/span><\/strong> the time to act is now.<\/p>\n<p><strong>Here are the ten documents you need to get locked down.<\/strong><\/p>\n<p><strong>A Will<\/strong>. The last will and testament does not have to be complicated. However, it does need to be prepared properly, so that it will be valid. If your family includes minor children, you need to name a guardian. Pick an executor who will be in charge when you pass. If you don’t have a will, the law of your state will determine how your assets are distributed, and a court will name a guardian for your children. It is better to have a will and put your wishes down in writing.<\/p>\n<p><strong>Life insurance.<\/strong> There are two basic kinds: term insurance, which covers about twenty years, and universal or whole, which covers you for your lifetime. You need enough to cover your liabilities: your home mortgage, college funding for your kids and any outstanding debts, like credit cards or a car loan. This way, you aren’t saddling heirs with your debt.<\/p>\n<p><strong>Durable power of attorney.<\/strong> This document lets you designate someone to pay your bills, manage your money and make financial decisions for you, if you become incapacitated. Without it, your relatives will need to go to court to be appointed power of attorney. Pick a trusted person and have the form done, when you meet with your estate planning attorney.<\/p>\n<p><strong>Twice your annual income in savings.<\/strong> Most Americans don’t do this. However, if you start saving, no matter how small an amount, you’ll be glad you did. You need savings to avoid creating debt, if an emergency occurs. A cash cushion of six months’ worth of monthly expenses in a savings account will give you peace of mind.<\/p>\n<p><strong>Insurance coverage.<\/strong> Make sure that you have the right insurance in place, in addition to life insurance. That means health insurance, auto insurance and disability insurance.<\/p>\n<p><strong>Credit report.<\/strong> People with better credit reports get better rates on home and auto loans. You can get them free from the big credit reporting services. Make sure everything is correct, from your address to your account history.<br \/>\nA letter of instruction. Where do you keep your estate planning documents? What about your bank statements, taxes and insurance documents? What about your digital assets? Keep a list for easy access for those who might have to figure out your affairs.<\/p>\n<p><strong>Retirement plan.<\/strong> Most people only know they don’t have enough saved for retirement. That’s not good enough. If you aren’t enrolled in your company’s 401(k) or other retirement savings plan, get on that right away. If your company matches contributions, make sure you are saving enough to get every bit of those matching dollars. If your company doesn’t have a retirement plan, then open an IRA or a Roth IRA on your own. You should try to contribute as much as you possibly can.<\/p>\n<p><strong>Updated resume.<\/strong> It also helps to do the same thing with your LinkedIn profile. No matter how long you’ve been in your field, everyone looks at your LinkedIn profile to see who you are and what and who you know. Make sure you have an updated resume, so you can easily send it out, whether it’s a casual conversation about a speaking opportunity or if you’re starting to look for a new position.<\/p>\n<p><strong>A budget.<\/strong> Here’s how you know you’re really an adult. Budgets went out of fashion for a while, but now they are bigger than avocado toast. If you don’t know what’s coming in and what’s going out, you can’t possibly have any kind of control or direction over your financial life. Start tracking your expenses, matching with your income and making any necessary changes.<\/p>\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/www.frankbrunolaw.com\/wp-content\/uploads\/2021\/09\/bucket-list-1.jpg\" alt=\"\" \/><\/figure>\n<p>One last thing—do you have a bucket list? Don’t wait until you’re 70 to consider all the places you’d like to go or the people you’d like to meet. It’s true–you only live once, and we should enjoy the ride.<\/p>\n<p>Reference:<\/p>\n<p><strong>Charlotte Five (April 23, 2019)<\/strong><em><strong> – <\/strong><\/em><strong><span style=\"color: #3ab3c7;\"> <em><a style=\"color: #3ab3c7;\" href=\"https:\/\/www.charlotteobserver.com\/charlottefive\" target=\"_blank\" rel=\"noopener\">“For ultimate adulting status, have these 10 documents by the time you’re 35”<\/a><\/em><\/span><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Fifty is a little on the late side to start taking care of these important life matters. However, it is better late than never. It’s easy to put these tasks off, since the busyness of our day-to-day lives gives us a good reason to procrastinate on the larger issues, like death and our own mortality.<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[20],"tags":[],"class_list":["post-1651","post","type-post","status-publish","format-standard","hentry","category-blog"],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1651","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/comments?post=1651"}],"version-history":[{"count":0,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1651\/revisions"}],"wp:attachment":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media?parent=1651"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/categories?post=1651"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/tags?post=1651"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}