{"id":1653,"date":"2022-02-28T08:45:46","date_gmt":"2022-02-28T08:45:46","guid":{"rendered":"https:\/\/mudratcs.com\/frank\/?p=1653"},"modified":"2024-05-23T10:33:11","modified_gmt":"2024-05-23T10:33:11","slug":"even-a-late-start-toward-retirement-planning-is-better-than-none-at-all","status":"publish","type":"post","link":"https:\/\/frankbrunolaw.com\/even-a-late-start-toward-retirement-planning-is-better-than-none-at-all\/","title":{"rendered":"Even a Late Start toward Retirement Planning is Better than None at All"},"content":{"rendered":"<p>“There’s never enough time to do all the nothing you want.” Bill Watterson, Calvin and Hobbes.<\/p>\n<p>“The trouble with retirement is that you never get a day off.” Abe Lemons.<\/p>\n<p>There are also people who wait until they become senior citizens to begin planning for retirement. That’s a little on the late side, but the important thing, says the article <em><strong><span style=\"color: #3ab3c7;\"><a style=\"color: #3ab3c7;\" href=\"https:\/\/martinsvillebulletin.com\/lifestyles\/features\/retirement-planning-start-now-to-help-social-security-medicare\/article_1082ca47-db03-592d-831e-dda0a514aab2.html\" target=\"_blank\" rel=\"noopener\">“Retirement Planning: Start now to help Social Security, Medicare”<\/a><\/span><\/strong> from Martinsville Bulletin<\/em>, is to get started. That’s better than doing nothing.<\/p>\n<p>It’s easier if you start earlier. Let’s consider the high school student who diligently puts away 10% of a $7.25 per hour gross minimum wage earning for a year on an average 20-hour work week. That’s $750 into a retirement plan after one year. If that student never went to college, never learned a trade, got a raise or a promotion, they would still have $34,500 in personal savings in 46 years. And since minimum wage increased those number swell to $1,560.00 for one year and $71,760.00. It’s not a lot, as retirement savings go, but it’s better than nothing.<\/p>\n<p>If the same high school student put those savings into an Individual Retirement Account (IRA), more would have been saved. The more time your money has to grow through compounding, the more money you’ll have.<\/p>\n<p>Saving a little money every month could make a big difference later on. This year, the average monthly Social Security benefit rounds out at about $1,460 per person, calculated by combining a worker’s highest paid years in the workplace. That’s not enough for retirement. The answer? Start saving early.<\/p>\n<p>It is not as easy to build a nest egg in a few years, but it’s possible.<\/p>\n<p>Many people don’t wake up to the reality of retirement, until they reach age 62. There’s still time to plan. They can put money into IRA accounts, and at age 62 they can save as much as $7,000. Those IRA contributions count as tax deductions.<\/p>\n<p>Roth IRAs are a little more flexible, but there are no tax deductions with contributions. On the plus side, when money is withdrawn, you’re not paying taxes on the withdrawals.<\/p>\n<p>Another important planning point for seniors: if you’ve had health issues, it’s a good idea to keep working to maintain your employee health insurance. The healthier you are, the lower your health insurance costs will be during retirement. However, health costs do tend to increase with age, so that has to be factored into your retirement planning.<\/p>\n<p>For people who take a lot of medication to control chronic conditions, they’ll need to look into health insurance outside of the workplace. That usually means Medicare. Most seniors are eligible for free Medicare hospital insurance, which is Part A of a four-part option, if they have worked and paid Medicare taxes.<\/p>\n<p>Part A helps pay for inpatient care in a hospital or skilled nursing facility after a hospital stay, some home health care and hospice care. Part B helps to pay for doctors and a variety of other services. Part C allows HMO, PPO and other health care organizations to offer health insurance plans for Medicare beneficiaries. Part D provides prescription drug benefits through private insurance companies.<\/p>\n<p>The Social Security Administration advises people to apply for Medicare three months before they celebrate their 65th birthday, regardless of whether they plan to start receiving retirement benefits right away.<\/p>\n<p>Whether you’re 27 or 57, you need to plan for retirement. You also need to have an estate plan, and that means making the time to meet with an experienced estate planning professional to discuss your life and your retirement plans. You’ll need their guidance to create a will and other documents.<\/p>\n<p>Advance planning will always be better than waiting until the last minute, for retirement and estate planning.<\/p>\n<p>Reference:<\/p>\n<ul>\n<li><strong>Martinsville Bulletin<\/strong> (May 17, 2019) <strong><span style=\"color: #3ab3c7;\"><em><a style=\"color: #3ab3c7;\" href=\"https:\/\/martinsvillebulletin.com\/lifestyles\/features\/retirement-planning-start-now-to-help-social-security-medicare\/article_1082ca47-db03-592d-831e-dda0a514aab2.html\" target=\"_blank\" rel=\"noopener\">“Retirement Planning: Start now to help Social Security, Medicare”<\/a><\/em><\/span><\/strong><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>“There’s never enough time to do all the nothing you want.” Bill Watterson, Calvin and Hobbes. “The trouble with retirement is that you never get a day off.” Abe Lemons. There are also people who wait until they become senior citizens to begin planning for retirement. That’s a little on the late side, but the<\/p>\n","protected":false},"author":1,"featured_media":1654,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[20],"tags":[],"class_list":["post-1653","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-blog"],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1653","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/comments?post=1653"}],"version-history":[{"count":0,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1653\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media\/1654"}],"wp:attachment":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media?parent=1653"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/categories?post=1653"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/tags?post=1653"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}