{"id":4241,"date":"2024-07-02T05:02:17","date_gmt":"2024-07-02T05:02:17","guid":{"rendered":"https:\/\/frankbrunolaw.com\/?p=4241"},"modified":"2024-07-31T05:49:41","modified_gmt":"2024-07-31T05:49:41","slug":"does-divorce-affect-social-security-spousal-benefits","status":"publish","type":"post","link":"https:\/\/frankbrunolaw.com\/does-divorce-affect-social-security-spousal-benefits\/","title":{"rendered":"Does Divorce Affect Social Security Spousal Benefits?"},"content":{"rendered":"<div><img fetchpriority=\"high\" decoding=\"async\" class=\"alignright wp-image-4242 size-large\" src=\"https:\/\/frankbrunolaw.com\/wp-content\/uploads\/2024\/07\/unnamed-1024x540.jpg\" alt=\"\" width=\"800\" height=\"422\" srcset=\"https:\/\/frankbrunolaw.com\/wp-content\/uploads\/2024\/07\/unnamed-1024x540.jpg 1024w, https:\/\/frankbrunolaw.com\/wp-content\/uploads\/2024\/07\/unnamed-300x158.jpg 300w, https:\/\/frankbrunolaw.com\/wp-content\/uploads\/2024\/07\/unnamed-768x405.jpg 768w, https:\/\/frankbrunolaw.com\/wp-content\/uploads\/2024\/07\/unnamed-1536x810.jpg 1536w, https:\/\/frankbrunolaw.com\/wp-content\/uploads\/2024\/07\/unnamed.jpg 2048w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/>More than 50 million Americans receive Social Security retirement benefits. Most of these recipients are retirees who worked and paid Social Security taxes. But millions of dependents and survivors of retired workers, including spouses and ex-spouses, also receive a monthly benefit from Social Security.<\/div>\n<div><\/div>\n<div>Spouses can collect Social Security benefits based on their fellow spouse’s work records. These benefits are also available to divorced spouses who meet certain criteria, even after their ex-spouse has remarried. <a href=\"https:\/\/frankbrunolaw.com\/divorce-family-law\/\">Divorced<\/a> spouses are entitled to survivor benefits as well in some situations.<\/div>\n<h2>Social Security Auxiliary Benefits<\/h2>\n<div>Social Security provides monthly benefit payments to retired and disabled workers. It also pays dependent benefits and survivor benefits — collectively known as auxiliary benefits — to the spouses, former spouses, children, parents, and widows\/widowers of retired, disabled, and deceased workers. In fact, more than 30 percent of new Social Security benefit awards in 2020 were auxiliary benefits.<\/div>\n<div>Retirement benefits make up the lion’s share (78.9 percent) of Social Security payments. Retired workers collect most of these payments (75.1 percent), according to Social Security Administration (SSA) <a id=\"m_-580831853074292476OWA3eb229fa-ab12-62f3-35c2-a60d1fb79695\" href=\"https:\/\/www.ssa.gov\/policy\/docs\/quickfacts\/stat_snapshot\/\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/www.ssa.gov\/policy\/docs\/quickfacts\/stat_snapshot\/&amp;source=gmail&amp;ust=1719982743844000&amp;usg=AOvVaw36n8gFZVs0ZW6GBTmBum6T\">data<\/a>. But the spouses of retired workers are the second most common recipient of Social Security retirement benefits.<\/div>\n<div><\/div>\n<div>As of March 2024, about 1.8 million spouses of retired workers — most of them <a id=\"m_-580831853074292476OWA44dc308a-7e0a-da5b-e5eb-a795311756fa\" href=\"https:\/\/www.forbes.com\/advisor\/retirement\/social-security-spousal-benefits\/\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/www.forbes.com\/advisor\/retirement\/social-security-spousal-benefits\/&amp;source=gmail&amp;ust=1719982743844000&amp;usg=AOvVaw3dSFWIn6hzk2pHhzvX2rzz\">women<\/a> — received Social Security benefits averaging $911 per month. Divorced spouses <a id=\"m_-580831853074292476OWA5bb1de3a-9553-3300-5154-09d7c6389a3e\" href=\"https:\/\/www.ssa.gov\/policy\/docs\/statcomps\/supplement\/2023\/6d.pdf\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/www.ssa.gov\/policy\/docs\/statcomps\/supplement\/2023\/6d.pdf&amp;source=gmail&amp;ust=1719982743844000&amp;usg=AOvVaw1YzIqh_sc1skcdfwO7MIxq\">comprise<\/a> approximately 12 percent of all spousal benefit awardees.<\/div>\n<div><\/div>\n<div>Social Security benefits are also available to surviving spouses. The survivor’s benefit is based on the deceased spouse’s lifetime earnings.<\/div>\n<div>Survivor benefits make up about 8.6 percent of all Social Security benefits, with monthly payments totaling $8.7 million and an average payment of just over $1,500 per month. Widows and widowers comprise about 65 percent of survivor beneficiaries.<\/div>\n<div><\/div>\n<div>In a 2021 <a id=\"m_-580831853074292476OWA20993b9e-9413-4014-54da-bd97bc8da963\" href=\"https:\/\/sgp.fas.org\/crs\/misc\/R41479.pdf\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/sgp.fas.org\/crs\/misc\/R41479.pdf&amp;source=gmail&amp;ust=1719982743844000&amp;usg=AOvVaw1NSFW7mg5sLzXFAQaEXNHT\">report<\/a>, the Congressional Research Service notes that spousal and survivor benefits were added to the Social Security system in 1939, when the majority of U.S. households consisted of a single earner, generally the husband.<\/div>\n<div><\/div>\n<div>Despite most women now working full-time — and <a id=\"m_-580831853074292476OWA8e1d5188-4a78-f59a-d84c-93353fd96fe2\" href=\"https:\/\/www.cnbc.com\/2023\/04\/20\/more-women-are-out-earning-their-husbands-in-the-us.html\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/www.cnbc.com\/2023\/04\/20\/more-women-are-out-earning-their-husbands-in-the-us.html&amp;source=gmail&amp;ust=1719982743844000&amp;usg=AOvVaw3hntKE1lHwKrTDrmkNdnWC\">increasingly out-earning<\/a> their husbands — women are vulnerable to poverty in old age, says the report. This is attributed to demographic and economic reasons that include a longer average lifespan, lower labor force participation, and an “earnings gap” that can lead to women receiving a lower Social Security benefit than men.<\/div>\n<h2>Social Security Spousal Benefits<\/h2>\n<div>To address the benefit disparity between men and women, while accounting for women’s now much-higher labor force participation and the increase in the number of divorces, the SSA has over the years modified how it administers Social Security spousal benefits. This includes allowing same-sex spouses to receive spousal benefits in the same way as opposite-sex spouses.<\/div>\n<div><\/div>\n<div>Today, many individuals who qualify for spousal benefits do so based on their spouse’s work records and their own work records.<\/div>\n<div><\/div>\n<div>As a spouse, you can claim Social Security benefits based on your own earnings record. Or you can collect a spousal benefit up to 50 percent of your spouse’s Social Security benefit.<\/div>\n<div><\/div>\n<div>Those who qualify for both do not receive both in full, but they are automatically entitled to whichever benefit is higher, and they can collect on their spouse’s record even if they never worked.<\/div>\n<div>You are eligible to receive Social Security spousal benefits when you turn 62 years old if your spouse is receiving retirement or disability benefits. However, if you choose to receive spousal benefits before you reach full retirement age (age 67 for anyone born in 1960 or later), your benefit amount will be permanently reduced.<\/div>\n<div><\/div>\n<div>These rules don’t apply to some child caregivers. If you are caring for a child younger than 16, or who has a disability and is entitled to receive benefits on your spouse’s record, you can qualify for Social Security spousal benefits at any age. Having a qualifying child in your care also means that you’ll receive your full spouse’s benefit even if you are under full retirement age.<\/div>\n<div>Spouses who do not have a qualifying child in their care and begin receiving benefits before full retirement age can use this <a id=\"m_-580831853074292476OWA2dbcda9e-aa8e-d03f-23e4-07098d4a84e6\" href=\"https:\/\/www.ssa.gov\/oact\/quickcalc\/spouse.html\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/www.ssa.gov\/oact\/quickcalc\/spouse.html&amp;source=gmail&amp;ust=1719982743844000&amp;usg=AOvVaw3iv69XPt_rLZy-iqtOHXnx\">calculator<\/a> to see how much their spousal benefit will be reduced.<\/div>\n<h2>Social Security Benefits for Divorced Spouses<\/h2>\n<div>As a divorced spouse, you can collect benefits on your ex-spouse’s record, even if the ex-spouse has remarried and the ex-spouse’s new spouse is collecting on the same record.<\/div>\n<div>To qualify for a divorced spouse Social Security benefit, you must meet the following requirements:<\/div>\n<ul>\n<li>You were married for at least 10 years (although the marriage could have been briefly interrupted by divorce during this period; see below).<\/li>\n<li>You are currently unmarried.<\/li>\n<li>You are at least 62 years old.<\/li>\n<li>Your ex-spouse is eligible for retirement benefits.<\/li>\n<li>The benefit you are entitled to receive based on your own work record is less than the benefit you would receive based on your ex-spouse’s work record.<\/li>\n<\/ul>\n<div>If your ex-spouse has not yet applied for retirement benefits but can qualify for them, you can receive benefits on their record, provided you have been divorced for at least two continuous years.<\/div>\n<div>And if you are eligible for both a spouse’s benefit and your own retirement benefit, you may have a choice between the two benefits, depending on your age, <a id=\"m_-580831853074292476OWA3a141243-9b60-ed8e-52b4-8f80dfcda09d\" href=\"https:\/\/www.ssa.gov\/benefits\/retirement\/planner\/applying7.html\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/www.ssa.gov\/benefits\/retirement\/planner\/applying7.html&amp;source=gmail&amp;ust=1719982743844000&amp;usg=AOvVaw1h7YG00agTxMBxCfjEOExo\">explains the SSA<\/a>.<\/div>\n<div><\/div>\n<div>Any Social Security benefits that you receive on an ex-spouse’s record may be reduced by you continuing to work and\/or receiving a pension from a government employer that wasn’t required to withhold Social Security taxes.<\/div>\n<h2>Divorced Spouse Benefits and Remarriage<\/h2>\n<div>If you remarry, you generally can&#8217;t receive benefits on your former spouse’s record unless the new marriage ends (by death, divorce, or annulment). In such cases, you can claim benefits on either spouse’s record,<\/div>\n<div>as long as each marriage meets eligibly requirements (it lasted at least 10 years, etc.) for divorced spouse benefits.<\/div>\n<div><\/div>\n<div>In limited cases, remarriage does not end benefits obtained on the record of a living former spouse. One of these exceptions applies if you remarry the same person.<\/div>\n<div><\/div>\n<div>A marriage to the same spouse could be interrupted by divorce and remarriage and still <a id=\"m_-580831853074292476OWA1734b87c-e6d1-6791-3da6-5d258eabd903\" href=\"https:\/\/secure.ssa.gov\/poms.nsf\/lnx\/0300202005\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/secure.ssa.gov\/poms.nsf\/lnx\/0300202005&amp;source=gmail&amp;ust=1719982743844000&amp;usg=AOvVaw35lVndrH20ULyA10fLCu5H\">qualify for divorced spouse benefits<\/a> if the remarriage took place no later than the calendar year immediately following the calendar year of the divorce.<\/div>\n<div><\/div>\n<div>According to <a id=\"m_-580831853074292476OWA2d15b3b0-0bd6-aa94-b0c0-8356c05d7c0c\" href=\"https:\/\/www.aarp.org\/retirement\/social-security\/questions-answers\/ex-remarry\/\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/www.aarp.org\/retirement\/social-security\/questions-answers\/ex-remarry\/&amp;source=gmail&amp;ust=1719982743844000&amp;usg=AOvVaw3q6WTwT_7DTj-eLHPmqzec\">AARP<\/a>, remarriage also may not terminate your ex-spouse benefits if your new spouse is receiving survivor benefits, divorced spouse benefits, or childhood disability benefits.<\/div>\n<div>Social Security Survivor Benefits for Divorced Spouses<\/div>\n<div><\/div>\n<div>The divorced spouse of a worker who has passed away could be eligible for Social Security payments equal to a surviving spouse benefit. To receive a survivor benefit as a divorced spouse, your marriage must have lasted 10 years or more and you must meet these other <a id=\"m_-580831853074292476OWAa792a8ca-8fd3-67b4-b9ae-4a38bfead025\" href=\"https:\/\/www.benefits.gov\/benefit\/4408\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/www.benefits.gov\/benefit\/4408&amp;source=gmail&amp;ust=1719982743844000&amp;usg=AOvVaw1-29ZdcNw5GQeYLUBOOMNI\">requirements<\/a>:<\/div>\n<ul>\n<li>You are at least age 60 (or between 50 and 59 if you have a disability).<\/li>\n<li>You are not entitled to a Social Security benefit on your own work record that is equal to or higher than a benefit from your deceased ex-spouse.<\/li>\n<li>You are unmarried (unless you qualify for an exception).<\/li>\n<\/ul>\n<div>The 10-year marriage requirement does not apply if you are caring for a child under age 16, or who has a disability, and the child qualifies for benefits on your former spouse’s record. The child must also be the natural or legal adopted child of your former spouse.<\/div>\n<div><\/div>\n<div><a id=\"m_-580831853074292476OWA90bb0323-5436-333d-9489-b814a72981b7\" href=\"https:\/\/www.ssa.gov\/benefits\/survivors\/onyourown.html\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/www.ssa.gov\/benefits\/survivors\/onyourown.html&amp;source=gmail&amp;ust=1719982743844000&amp;usg=AOvVaw2HwK8IGLvSxW800qdA_r4P\">Survivor benefits<\/a> are equivalent to the deceased worker’s full Social Security benefit amount. However, there is a maximum family amount—typically between 150 percent and 180 percent of a worker’s full retirement benefit—that survivors can collectively receive each month.<\/div>\n<div>The SSA states that a benefit paid to a surviving divorced spouse will not affect the amount of benefits other surviving family members can receive, unless the ex-spouse is a divorced parent caring for the child of a deceased worker, in which case their benefits could affect the benefits of other survivors.<\/div>\n<div>Divorced widow\/widower payments are also subject to these SSA rules:<\/div>\n<ul>\n<li>If you remarry before age 50 you can&#8217;t collect survivor benefits unless you divorce.<\/li>\n<li>If you remarry between ages 50 and 59 you aren’t eligible for survivor benefits.<\/li>\n<li>If you remarry after age 60 you can still receive survivor benefits based on your former spouse’s record. But if your new spouse is also collecting Social Security benefits, and you would receive a higher amount based on the new spouse’s work record, you will receive the higher amount.<\/li>\n<\/ul>\n<div>Once you reach full retirement age and are eligible for both a survivor benefit and your own retirement benefit, you can choose to take survivor benefits first, letting your own benefits vest and then switching to retirement benefits later if that benefit is larger.<\/div>\n<div><\/div>\n<div>Surviving divorced spouses cannot apply online for survivor’s benefits. Contact the SSA at 1-800-772-1213 (TTY 1-800-325-0778) to request an in-person appointment at your local Social Security office.<\/div>\n<div>You can use this <a id=\"m_-580831853074292476OWAd543ba85-65b7-816e-0694-e88b30c2de1e\" href=\"https:\/\/ssabest.benefits.gov\/benefit-finder\/\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/ssabest.benefits.gov\/benefit-finder\/&amp;source=gmail&amp;ust=1719982743844000&amp;usg=AOvVaw34GvJrJgV_I11S80RUrYet\">screening tool<\/a> to determine your eligibility for the different Social Security benefit programs. You may also benefit from consulting with your elder law attorney. They can help you choose the benefit option that works best for your situation.<\/div>\n","protected":false},"excerpt":{"rendered":"<p>More than 50 million Americans receive Social Security retirement benefits. Most of these recipients are retirees who worked and paid Social Security taxes. But millions of dependents and survivors of retired workers, including spouses and ex-spouses, also receive a monthly benefit from Social Security. Spouses can collect Social Security benefits based on their fellow spouse’s [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[20,8],"tags":[],"class_list":["post-4241","post","type-post","status-publish","format-standard","hentry","category-blog","category-divorce"],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/4241","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/comments?post=4241"}],"version-history":[{"count":2,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/4241\/revisions"}],"predecessor-version":[{"id":4310,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/4241\/revisions\/4310"}],"wp:attachment":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media?parent=4241"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/categories?post=4241"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/tags?post=4241"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}