{"id":1355,"date":"2022-04-07T11:16:36","date_gmt":"2022-04-07T11:16:36","guid":{"rendered":"https:\/\/mudratcs.com\/frank\/?p=1355"},"modified":"2024-05-27T07:04:38","modified_gmt":"2024-05-27T07:04:38","slug":"using-trusts-to-maintain-control-of-inheritances","status":"publish","type":"post","link":"https:\/\/frankbrunolaw.com\/using-trusts-to-maintain-control-of-inheritances\/","title":{"rendered":"Using Trusts to Maintain Control of Inheritances"},"content":{"rendered":"<p>“The spendthrift robs his heirs the miser robs himself.” Jean De La Bruyere<\/p>\n<p>“If the Nation is living within its income, its credit is good. If, in some crises, it lives beyond its income for a year or two, it can usually borrow temporarily at reasonable rates. But if, like a spendthrift, it throws discretion to the winds, and is willing to make no sacrifice at all in spending; if it extends its taxing to the limit of the peoples power to pay and continues to pile up deficits, then it is on the road to bankruptcy.” Franklin D. Roosevelt<\/p>\n<p>Trusts, like estate plans, are not just for the wealthy. They are used to provide control, in how assets of any size are passed to another person. Leaving an inheritance to a beneficiary in a trust, according to the article from <em>Times Herald-Record<\/em> titled <span style=\"color: #3bb4c9;\"><strong><em>“Leaving inheritances to trusts puts you in control,”<\/em><\/strong><\/span> can protect the inheritance and the asset from being mishandled. Protection can be the main intention for creating a trust.<\/p>\n<p>For many parents, the inheritance equation is simple. They leave their estate to their children “per stirpes,” which in Latin translates to “by roots.” In other words, the assets are left to children according to the roots of the family tree. The assets go to the children, but if they predecease you, the assets go to their children. The assets remain in the family. If the child dies after the parent, they leave the inheritance to their spouse.<\/p>\n<p>An alternative is to create inheritance trusts for children. They may spend the money as they wish, but any remaining assets goes to their children (your grandchildren) and not to the surviving spouse of your child. The grandchildren won’t gain access to the money, until you so provide. However, someone older, a trustee, may spend the money on them for their health, education and general welfare. The inheritance trust also protects the assets from any divorces, lawsuits or creditors.<\/p>\n<p>This is also a good way for parents, who are concerned about the impact of their wealth on their children, to maintain some degree of control. One strategy is a graduated payment plan. A certain amount of money is given to the child at certain ages, often 20% when they reach 35, half of the remainder at age 40 and the balance at age 45. Until distributions are made to the heirs, <strong><span style=\"color: #3bb4c9;\"><a style=\"color: #3bb4c9;\" href=\"https:\/\/frankbrunolaw.com\/why-do-i-need-an-estate-plan\/\" target=\"_blank\" rel=\"noopener\">a trustee may use the money for the person’s benefit at the trustee’s discretion.<\/a><\/span><\/strong><\/p>\n<p>The main concern is that money not be wasted by spendthrift heirs. In that situation, a spendthrift trust restricts payments to or for the beneficiary and may only be used at the trustee’s discretion. A lavish lifestyle won’t be funded by the trust.<\/p>\n<p>If money is being left to a disabled individual who receives <strong><span style=\"color: #3bb4c9;\">government benefits, like Medicaid <\/span><\/strong>or Supplemental Security Income (SSI), you may need a Special Needs Trust. The trustee can pay for services or items for the beneficiary directly, without affecting government benefits. The beneficiary may not receive any money directly.<\/p>\n<p>If an older person is a beneficiary, you also have the option to leave them an “income only trust.” They have no right to receive any of the trust’s principal. If the beneficiary requires nursing home care and must apply for Medicaid, the principal is protected from nursing home costs.<\/p>\n<p>An estate planning attorney will be able to review your family’s situation and determine which type of trust would be best for your family because using trusts to maintain control of inheritances works best.<\/p>\n<p><em>Reference<\/em>: <strong>Times Herald-Record<\/strong> (Feb. 16, 2019) <strong><span style=\"color: #3bb4c9;\"><em>“Leaving inheritances to trusts puts you in control”<\/em><\/span><\/strong><\/p>\n<p>Using Trusts to Maintain Control of Inheritances.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>“The spendthrift robs his heirs the miser robs himself.” Jean De La Bruyere “If the Nation is living within its income, its credit is good. If, in some crises, it lives beyond its income for a year or two, it can usually borrow temporarily at reasonable rates. But if, like a spendthrift, it throws discretion<\/p>\n","protected":false},"author":1,"featured_media":1356,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[20,10],"tags":[],"class_list":["post-1355","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-blog","category-elder-law"],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1355","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/comments?post=1355"}],"version-history":[{"count":0,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1355\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media\/1356"}],"wp:attachment":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media?parent=1355"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/categories?post=1355"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/tags?post=1355"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}