{"id":1487,"date":"2022-07-11T11:43:06","date_gmt":"2022-07-11T11:43:06","guid":{"rendered":"https:\/\/mudratcs.com\/frank\/?p=1487"},"modified":"2023-11-02T06:29:45","modified_gmt":"2023-11-02T06:29:45","slug":"what-is-a-proprietary-lease","status":"publish","type":"post","link":"https:\/\/frankbrunolaw.com\/what-is-a-proprietary-lease\/","title":{"rendered":"What Is a Proprietary Lease?"},"content":{"rendered":"<p>A proprietary lease is a complex yet common agreement between the tenants or residents of a cooperative building (a co-op) and the cooperative corporation managing and running the building. Co-ops are highly common in New York City, but living in a co-op is different from living as a tenant, resident, or owner of your own condo or apartment. Co-op tenants are subject to the proprietary lease rules and the relevant by-laws of the property where they reside, and not all state tenant-landlord rules will apply. This can lead to serious conflicts of interest and legal and financial issues. <a href=\"https:\/\/frankbrunolaw.com\/contact\/\" target=\"_blank\" rel=\"noopener\"><strong><span style=\"color: #3ab3c7;\">Contact<\/span><\/strong><\/a> the Law Offices of Bruno Reyes for assistance with rent, residency, ownership, conflict, or any other challenges you may face as a resident of and a shareholder in a cooperative building.<\/p>\n<h2>The Proprietary Lease and the Co-Op By-Laws<\/h2>\n<p>In a traditional rental arrangement, when you rent an apartment, you are classified as a tenant. However, in a co-op, you are a shareholder in the building in which you reside and New York City rent regulations do not classify you as a tenant but as a shareholder and an indirect owner of the building. Therefore, the terms of your proprietary lease and New York State’s business laws that govern corporations that operate for shareholder profit will apply, not traditional landlord-tenant laws.<\/p>\n<p>The proprietary lease is much like a standard lease in that it outlines the relationship, responsibilities, and expectations between the building corporation and each shareholder, with shareholders then residing in and becoming a tenant of the building.<\/p>\n<p>There is another document, however, that is an important part of the co-op agreement. These are the by-laws, which are the rules of the co-op. They outline how the property is managed and organized, as well as who can run for a seat on the board and how elections are held. The by-laws may also contain a section called the house rules that contain rules specific to residents of the building.<\/p>\n<p>Since these are rules and functions that have important legal implications, speak with the experienced proprietary lease lawyers at the Law Offices of Bruno Reyes before drawing up a proprietary lease, entering into an agreement with a co-op, or for assistance with legal or financial issues pertaining to a co-op.<\/p>\n<h2>Responsibilities of Different Parties Under the Proprietary Lease<\/h2>\n<p>The proprietary lease will specifically mention how the co-op will manage building maintenance to maximize the benefit of all of the building’s shareholders. This includes specifics on, for example, monthly maintenance outlays and how compliance with applicable local, state, and federal laws will be ensured.<\/p>\n<p>The proprietary lease also details the responsibilities and expectations of each shareholder. Some of these responsibilities can include regular repairs and maintenance in the tenant’s apartment that must be performed by the tenant, and how renovations (and what kinds) can be performed.<\/p>\n<h2>Proprietary Lease Legal Issues<\/h2>\n<p>As mentioned above, the business cooperative owns the co-op building and the tenants are considered shareholders – not statutory tenants. The proprietary lease also governs the relationship between the tenants and the co-op. Co-ops can use these facts to their advantage and can work whatever rules and regulations they want into the proprietary lease. This can lead to serious legal issues for you.<\/p>\n<p>For example, proprietary leases are drawn up in such a way to indemnify the co-op of any sort of liability. This means the co-op will not be liable for damage or losses of any kind that result from a shareholder’s failure to comply with the lease document. This also applies to building guests and contractors.<\/p>\n<p>Furthermore, breaching the house rules and failing to comply with any of the rules of the proprietary lease can be interpreted as a default by the shareholder. The co-op can even alter, update, or amend the house rules, and tenants must comply with these new rules.<\/p>\n<p>The co-op always has a copy of the key to your unit and can always access it, although it will typically have to give you adequate notice before doing so. However, issues can arise here as well if the co-op is unfair or unreasonable in any way when it comes to apartment access and you are affected or even evicted for refusing access on reasonable grounds.<\/p>\n<p>Another serious issue with proprietary leases is the fact that the co-op can evict you and repossess your unit if the proprietary lease allows them to do so. It may seem strange that a building shareholder and tenant can be evicted in this way, but the proprietary lease gives the co-op the right to do exactly this if the tenant violates the proprietary lease in any way. Examples of how this can happen include if the shareholder or tenant becomes bankrupt, allows unauthorized subletting, defaults on a rental payment, is found guilty of offensive conduct, or is determined to have broken any of the proprietary lease’s rules in any way.<\/p>\n<p>Finally, an important legal and financial issue with proprietary leases is that shareholders automatically lose money if someone files a mechanic’s lien against the building. For example, let’s suppose you call a plumber and they come over but do not do the work they were supposed to do but bill you anyway and you dispute the claim. The plumber can file a lien, but instead of falling on your unit, the claim will be against the entire building. The co-op may choose to automatically pay it to avoid court proceedings and an investigation but the co-op will then bill you the amount plus any relevant expenses. As a shareholder, you always lose in such disputes with a contractor and it can be very challenging to get your money back without a lawsuit.<\/p>\n<h2>Contact the Law Offices of Bruno Reyes Today for Legal Assistance with a Proprietary Lease<\/h2>\n<p>If you are evicted from your home because of a simple clause in your proprietary lease or face other serious issues or disputes with your co-op “landlord,” you will face life-altering and potentially long-term personal and financial consequences. It can be difficult to secure your rights as a private party and resident in a co-op, but the experienced proprietary lease attorney with the Law Offices of Bruno Reyes is just a call away. We can help protect you and will fight your case to secure your personal and financial well-being, so do not hesitate to call us today for a free, no-obligation case evaluation.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A proprietary lease is a complex yet common agreement between the tenants or residents of a cooperative building (a co-op) and the cooperative corporation managing and running the building. Co-ops are highly common in New York City, but living in a co-op is different from living as a tenant, resident, or owner of your own<\/p>\n","protected":false},"author":1,"featured_media":1488,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[20,15],"tags":[],"class_list":["post-1487","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-blog","category-proprietary-lease"],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1487","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/comments?post=1487"}],"version-history":[{"count":0,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1487\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media\/1488"}],"wp:attachment":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media?parent=1487"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/categories?post=1487"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/tags?post=1487"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}