{"id":1500,"date":"2022-03-12T04:43:35","date_gmt":"2022-03-12T04:43:35","guid":{"rendered":"https:\/\/mudratcs.com\/frank\/?p=1500"},"modified":"2024-05-27T06:03:51","modified_gmt":"2024-05-27T06:03:51","slug":"creating-an-estate-plan-for-a-child-with-special-needs","status":"publish","type":"post","link":"https:\/\/frankbrunolaw.com\/creating-an-estate-plan-for-a-child-with-special-needs\/","title":{"rendered":"Creating an Estate Plan for a Child with Special Needs"},"content":{"rendered":"<p><em>“As special needs parents we don’t have the power to make life “fair,” but we do have the power to make life joyful.” <strong>Anonymous<\/strong><\/em><\/p>\n<p><em>“All kids need is a little help, a little hope, and someone who believes in them” <strong>Magic Johnson<\/strong>.<\/em><\/p>\n<p>Parents want their children to be taken care of after they die. But children with special needs have increased financial and care needs, so ensuring their long-term welfare can be tricky. Proper planning by parents is necessary to benefit the child with a disability, including an adult child, as well as assist any siblings who may be left with the caretaking responsibility.<\/p>\n<p><strong>Special Needs Trusts<\/strong><\/p>\n<p>The best and most comprehensive option to protect a loved one is to set up a special needs trust (also called a supplemental needs trust). These trusts allow beneficiaries to receive inheritances, gifts, lawsuit settlements, or other funds and yet not lose their eligibility for certain government programs, such as Medicaid and Supplemental Security Income (SSI). The trusts are drafted so that the funds will not be considered to belong to the beneficiaries in determining their eligibility for public benefits.<\/p>\n<p>There are three main types of special needs trusts:<\/p>\n<p>A first-party trust is designed to hold a beneficiary’s own assets. While the beneficiary is living, the funds in the trust are used for the beneficiary’s benefit, and when the beneficiary dies, any assets remaining in the trust are used to reimburse the government for the cost of medical care. These trusts are especially useful for beneficiaries who are receiving Medicaid, SSI or other needs-based benefits and come into large amounts of money, because the trust allows the beneficiaries to retain their benefits while still being able to use their own funds when necessary.<\/p>\n<p>The third-party special needs trust is most often used by parents and other family members to assist a person with special needs. These trusts can hold any kind of asset imaginable belonging to the family member or other individual, including a house, stocks and bonds, and other types of investments. The third-party trust functions like a first-party special needs trust in that the assets held in the trust do not affect a beneficiary’s access to benefits and the funds can be used to pay for the beneficiary’s supplemental needs beyond those covered by government benefits. The key distinction is that a third-party special needs trust does not contain the “payback” provision found in first-party trusts. This means that when the beneficiary with special needs dies, any funds remaining in the trust can pass to other family members, or to charity, without having to be used to reimburse the government.<\/p>\n<p>A pooled trust is an alternative to the first-party special needs trust. Essentially, a charity sets up these trusts that allow beneficiaries to pool their resources with those of other trust beneficiaries for investment purposes, while still maintaining separate accounts for each beneficiary’s needs. When the beneficiary dies, the funds remaining in the account reimburse the government for care, but a portion also goes towards the non-profit organization responsible for managing the trust.<\/p>\n<p><strong>Life Insurance<\/strong><\/p>\n<p>Not everyone has a large chunk of money that can be left to a special needs trust, so life insurance can be an essential tool. If a special needs trust has been created, a life insurance policy can pay directly into it, and it does not have to go through probate or be subject to estate tax. Be sure to review the beneficiary designation to make sure it names the trust, not the child. You should make sure you have enough insurance to pay for your child’s care long after you are gone. Without proper funding, the burden of care may fall on siblings or other family members. Using a life insurance policy will also guarantee future funding for the trust while keeping the parents estate intact for other family members. When looking for life insurance, consider a second-to-die policy. This type of policy only pays out after the second parent dies, and it has the benefit of lower premiums than regular life insurance policies.<\/p>\n<p><strong>ABLE Account<\/strong><\/p>\n<p>An Achieving a Better Life Experience (ABLE) account allows people with disabilities who became disabled before they turned 26 to set aside up to $15,000 a year in tax-free savings accounts without affecting their eligibility for government benefits. This money can come from the individual with the disability or anyone else who may wish to give him money.<\/p>\n<p>Created by Congress in 2014 and modeled on 529 savings plans for higher education, these accounts can be used to pay for qualifying expenses of the account beneficiary, such as the costs of treating the disability or for education, housing and health care, among other things. ABLE account programs have been rolling out on a state-by-state basis, but even if your state does not yet have its own program, many state programs allow out-of-state beneficiaries to open accounts. (For a directory of state programs, click here.)<\/p>\n<p>Although it may be easy to set up an ABLE account, there are many hidden pitfalls associated with spending the funds in the accounts, both for the beneficiary and for her family members. In addition, ABLE accounts cannot hold more than $100,000 without jeopardizing government benefits like Medicaid and SSI. If there are funds remaining in an ABLE account upon the death of the account beneficiary, they must be first used to reimburse the government for Medicaid benefits received by the beneficiary, and then the remaining funds will have to pass through probate in order to be transferred to the beneficiary &amp; heirs.<\/p>\n<p><strong><span style=\"color: #3ab3c7;\">Get Help <\/span><\/strong>With Your desire to Create an Estate Plan for a Child with Special Needs.<\/p>\n<p>Creating an Estate Plan for a Child with Special Needs takes forethought, patience and a willingness to include caregivers in your plan. you decide to provide for a child with special needs, proper planning is essential. Talk to your attorney to determine the best plan for your family.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>“As special needs parents we don’t have the power to make life “fair,” but we do have the power to make life joyful.” Anonymous “All kids need is a little help, a little hope, and someone who believes in them” Magic Johnson. Parents want their children to be taken care of after they die. But children with<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[20,12],"tags":[],"class_list":["post-1500","post","type-post","status-publish","format-standard","hentry","category-blog","category-guardianship"],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1500","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/comments?post=1500"}],"version-history":[{"count":0,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1500\/revisions"}],"wp:attachment":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media?parent=1500"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/categories?post=1500"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/tags?post=1500"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}