{"id":1512,"date":"2022-02-21T05:17:57","date_gmt":"2022-02-21T05:17:57","guid":{"rendered":"https:\/\/mudratcs.com\/frank\/?p=1512"},"modified":"2024-05-23T10:32:16","modified_gmt":"2024-05-23T10:32:16","slug":"britney-spears-guardianship-case","status":"publish","type":"post","link":"https:\/\/frankbrunolaw.com\/britney-spears-guardianship-case\/","title":{"rendered":"Britney Spears: Guardianship Case"},"content":{"rendered":"<p>The case of Britney Spears’s guardianship is a high-profile, widely-publicized matter. However, even though Ms. Spears has been the hot topic of conversation on the news and in the media recently, very little is actually known about the details of her situation.<\/p>\n<p>I have held every attorney position in the field of guardianship, often I am appointed to a role by the Judge overseeing the case. Other times a private client hires me and I have been Petitioner’s Counsel, Counsel for the Alleged Incapacitated Person, Court Evaluator, Guardian, and Court Examiner. After the Hearing I have even been the Attorney for the Incapacitated Person and also as a Referee to hear and determine issues in the case. Over my twenty five years of experience, I have encountered a number of cases with the same general premise as this one. Although much of Ms. Spears’s case has not been revealed to the public, in many ways her circumstances are not unique. Let’s start with what we do know.<\/p>\n<p>When a person faces certain “functional limitations,” and it is alleged that they are incapacitated, legal action is taken to obtain a guardian who can take care of this person when they are unable to take care of themselves.<\/p>\n<p>A functional limitation is any incapacity that puts the person in question, or those around them, in a position of danger. This can be due to debilitating mental illness, cognitive or developmental disability, mental or physical decline due to old age, or any other impairment that has prevented that person from functioning safely and independently in daily life.<\/p>\n<p>As a result of a functional limitation, a person may be susceptible to abuse or neglect, which is why the courts take legal intervention to protect such vulnerable people.<\/p>\n<p>In this case, it is unknown what specific “functional limitations” the judge established for Ms. Spears – that is up for speculation. We do know that Judge Brenda Penny, determined that Ms. Spears poses a danger to herself or others, based on a thorough examination of her state of wellbeing. As a result, she has been under a Conservatorship for the past thirteen years. Conservatorship is a legal concept whereby a court appoints a person to manage an incapacitated person or minor’s financial and personal affairs. New York has modified their laws so that Conservatorships are now Guardianships.<\/p>\n<p>In any case, we can reserve judgement or hasty condemnation of anyone involved, including Britney Spears’s father. It is easy to make assumptions based on the limited information available to us.<\/p>\n<p>Very few are privy to the full story, and in the meantime I will empathize with Ms. Spears and her family and respect their privacy, and I urge you to do the same. I have seen some truly tragic guardianship proceedings – one thing I am sure of is that it is impossible to know what is going on behind closed doors.<\/p>\n<p>I wish the best for Ms. Spears and her family, and will be eagerly awaiting a swift and just resolution for all involved.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The case of Britney Spears’s guardianship is a high-profile, widely-publicized matter. However, even though Ms. Spears has been the hot topic of conversation on the news and in the media recently, very little is actually known about the details of her situation. I have held every attorney position in the field of guardianship, often I<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[20,12],"tags":[],"class_list":["post-1512","post","type-post","status-publish","format-standard","hentry","category-blog","category-guardianship"],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1512","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/comments?post=1512"}],"version-history":[{"count":0,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1512\/revisions"}],"wp:attachment":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media?parent=1512"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/categories?post=1512"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/tags?post=1512"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}