{"id":1599,"date":"2022-04-01T10:26:35","date_gmt":"2022-04-01T10:26:35","guid":{"rendered":"https:\/\/mudratcs.com\/frank\/?p=1599"},"modified":"2024-05-27T10:07:43","modified_gmt":"2024-05-27T10:07:43","slug":"what-the-elder-law-estate-planning-attorney-needs-to-know","status":"publish","type":"post","link":"https:\/\/frankbrunolaw.com\/what-the-elder-law-estate-planning-attorney-needs-to-know\/","title":{"rendered":"What the Elder Law Estate Planning Attorney Needs to Know"},"content":{"rendered":"<p>“Anyone may arrange his affairs so that his taxes shall be as low as possible; he is not bound to choose that pattern which best pays the treasury. There is not even a patriotic duty to increase one’s taxes. Over and over again the Courts have said that there is nothing sinister in so arranging affairs as to keep taxes as low as possible. Everyone does it, rich and poor alike and all do right, for nobody owes any public duty to pay more than the law demands.” Learned Hand<\/p>\n<p>“In America, there are two tax systems: one for the informed and one for the uninformed. Both are legal.” Learned hand<\/p>\n<p>If you went to a doctor’s office and did not tell the doctor what your symptoms were, it would be hard to get a good diagnosis and treatment. The same goes for a visit to the elder law estate planning attorney. Without all the necessary facts, advises the Times Herald-Record in the article <strong><span style=\"color: #3ab3c7;\"><em>“What you need to tell the elder law estate planning attorney,”<\/em> <\/span><\/strong>the estate plan may need to be revised or created all over again, the inheritance may be given to people other than those you intended and there could be family conflicts.<\/p>\n<p>Elder law is all about the issues that affect the elderly client. The planning for disability and incapacity, to include identifying the people who would make decisions for you, if you become incapacitated and protecting your hard-earned assets from the cost of nursing home care.<\/p>\n<p>Estate planning is focused on transferring assets to the desired people, the way you want, when you want, with minimal court costs, taxes, or unnecessary legal fees and avoiding disputes over an inheritance. Here are some of the things your attorney will need to know, with full disclosure from you:<\/p>\n<p>Family dynamics. Do you have a child out of wedlock? Are you part of a blended family or do you have a child you haven’t seen in years, you need to discuss the child. They may have a legal claim to your estate, and that must be planned for. Perhaps you want to include the child in the estate, perhaps you don’t. <span style=\"color: #3ab3c7;\"><a style=\"color: #3ab3c7;\" href=\"https:\/\/frankbrunolaw.com\/why-should-i-create-a-trust-if-im-not-rich\/\" target=\"_blank\" rel=\"noopener\"><strong>If you disinherit a child in a will and you die without a plan, that child becomes a necessary party to probate proceedings and has the right to contest your will.<\/strong><\/a><\/span><\/p>\n<p>Health issues are important to disclose. If you don’t have long-term care insurance, you need five years to protect assets in a Medicaid Asset Protection Trust (MAPT). Therefore, now may be the time to start a plan. If you have a child who is disabled and receives government benefits, you can leave them money in a <span style=\"color: #3ab3c7;\"><strong><a style=\"color: #3ab3c7;\" href=\"https:\/\/frankbrunolaw.com\/creating-an-estate-plan-for-a-child-with-special-needs\/\" target=\"_blank\" rel=\"noopener\">Special Needs Trust (SNT).<\/a><\/strong><\/span><\/p>\n<p><strong><span style=\"color: #3ab3c7;\"><a style=\"color: #3ab3c7;\" href=\"https:\/\/frankbrunolaw.com\/digital-assets-in-estate-planning-the-brave-new-world-of-estate-planning\/\" target=\"_blank\" rel=\"noopener\">Full disclosure of all your assets, income, how assets are titled, who the beneficiaries are on your IRAs, 401(k)s and life insurance policies,<\/a><\/span><\/strong> are all the kinds of information needed to create a comprehensive estate plan. Keeping secrets during this process could lead to a wide variety of problems for your family. Your entire estate could be consumed by taxes, or the cost of nursing home care.<\/p>\n<p>There’s no doubt of the seriousness of these issues. You or your spouse may experience some strong emotions, while discussing them with your attorney. However, creating a proper estate plan, preparing for incapacity and loved ones with special challenges will provide you with peace of mind.<\/p>\n<p>One last point: an estate plan is like your home, requiring maintenance and updates. Once it is done, make a note in your schedule to review it every time there is a major life event or every three or four years. Laws change, and life changes. Your estate plan may also need to change.<\/p>\n<p>Reference: <strong>Times Herald-Record<\/strong> (May 25, 2019)<strong><span style=\"color: #3ab3c7;\"> <em>“What you need to tell the elder law estate planning attorney”<\/em><\/span><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>“Anyone may arrange his affairs so that his taxes shall be as low as possible; he is not bound to choose that pattern which best pays the treasury. There is not even a patriotic duty to increase one’s taxes. Over and over again the Courts have said that there is nothing sinister in so arranging<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[20],"tags":[],"class_list":["post-1599","post","type-post","status-publish","format-standard","hentry","category-blog"],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1599","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/comments?post=1599"}],"version-history":[{"count":0,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1599\/revisions"}],"wp:attachment":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media?parent=1599"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/categories?post=1599"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/tags?post=1599"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}