{"id":1656,"date":"2022-03-01T08:49:32","date_gmt":"2022-03-01T08:49:32","guid":{"rendered":"https:\/\/mudratcs.com\/frank\/?p=1656"},"modified":"2024-05-23T10:33:22","modified_gmt":"2024-05-23T10:33:22","slug":"estate-planning-when-a-family-member-is-disabled","status":"publish","type":"post","link":"https:\/\/frankbrunolaw.com\/estate-planning-when-a-family-member-is-disabled\/","title":{"rendered":"Estate Planning When A Family Member Is Disabled"},"content":{"rendered":"<p>This kind of mistake can wreak havoc on many lives, which is why it is so important to work with an experienced estate planning attorney who is knowledgeable about special needs planning. The article, “<strong><span style=\"color: #3ab3c7;\"><em><a style=\"color: #3ab3c7;\" href=\"https:\/\/www.theledger.com\/news\/20190502\/law-crafting-estate-plan-to-include-disabled-family-members\" target=\"_blank\" rel=\"noopener\">Crafting an estate plan to include disabled family members<\/a><\/em><\/span><\/strong><em>”<\/em><\/p>\n<p>from The Ledger explains what is involved in special needs planning.<\/p>\n<p>Supplemental Security Income (SSI) is a federal program that pays monthly benefits to disabled or blind adults and children. To qualify, an individual must have fewer than $2,000 of countable assets and very limited income. Medicaid is a Federal and State health insurance program that helps people with limited assets and income pay for their medical costs.<\/p>\n<p>While it is common for people to name their spouse or children as beneficiaries in their estate plan, if your spouse or child is disabled and receiving government benefits, an inheritance will result in their loss of benefits, unless special planning is done.<\/p>\n<p>Estate Planning When a Family Member Is Disabled. Special Needs Trust (SNT) is designed for disabled beneficiaries so that cash, real property, or any other assets are available for the person’s benefit, while still allowing the disabled person to receive their means-based government benefits.<\/p>\n<p>There are several different ways to accomplish this, depending on your family’s situation. One way is to have a testamentary Special Needs Trust created within a will or trust that goes into effect, when the creator of the trust or the will dies. A SNT can also be created while you are living and can be funded, instead of waiting for it to go into effect at your death.<\/p>\n<p>A third-party SNT can be named as the beneficiary of life insurance policies and retirement accounts, investment accounts or real property. The third-party SNT assets that are not used for the disabled beneficiary during their lifetime, can pass to non-disabled beneficiaries upon the death of the disabled beneficiary.<\/p>\n<p>These assets will be free from Medicaid recovery liens, since the property in a third party SNT does not belong to the disabled beneficiary<\/p>\n<p>Estate Planning When a Family Member Is Disabled. A first party SNT is set up and funded with assets that do belong to a disabled person, and no other funds can be contributed to this type of trust by any other donors. These are often used when a large settlement following an injury is awarded. In Florida and in other states, first-party SNTs are subject to Medicaid recovery to reimburse the state.<\/p>\n<p>Special needs trusts are complicated trusts and require the knowledge of an experienced attorney who devotes most, if not all, of their practice to SNTs and trust and estate planning.<\/p>\n<p>Reference:<strong> The Leadger <\/strong>(May 2, 2019) “<strong><span style=\"color: #3ab3c7;\"><a style=\"color: #3ab3c7;\" href=\"https:\/\/www.theledger.com\/news\/20190502\/law-crafting-estate-plan-to-include-disabled-family-members\" target=\"_blank\" rel=\"noopener\"><em>Crafting an estate plan to include disabled family members<\/em><\/a><\/span><\/strong>”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>This kind of mistake can wreak havoc on many lives, which is why it is so important to work with an experienced estate planning attorney who is knowledgeable about special needs planning. The article, “Crafting an estate plan to include disabled family members”  from The Ledger explains what is involved in special needs planning. Supplemental<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[20],"tags":[],"class_list":["post-1656","post","type-post","status-publish","format-standard","hentry","category-blog"],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1656","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/comments?post=1656"}],"version-history":[{"count":0,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1656\/revisions"}],"wp:attachment":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media?parent=1656"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/categories?post=1656"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/tags?post=1656"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}