{"id":1673,"date":"2022-03-06T09:13:24","date_gmt":"2022-03-06T09:13:24","guid":{"rendered":"https:\/\/mudratcs.com\/frank\/?p=1673"},"modified":"2024-05-23T10:34:20","modified_gmt":"2024-05-23T10:34:20","slug":"big-eight-retirement-mistakes-to-avoid","status":"publish","type":"post","link":"https:\/\/frankbrunolaw.com\/big-eight-retirement-mistakes-to-avoid\/","title":{"rendered":"Big Eight: Retirement Mistakes to Avoid"},"content":{"rendered":"<p>“You don’t stop laughing when you grow old, you grow old when you stop laughing.” George Bernard Shaw.<\/p>\n<p>“Living each day as if it were your last doesn’t mean your last day of retirement on a remote island. It means to live fully, authentically and spontaneously with nothing being held back.” Jack Canfield.<\/p>\n<p>During our working lives, we have a cash flow called a “paycheck” that we rely on. A similar cash flow occurs when we retire and start the process of “deaccumulation” or creating income streams from sources that include our retirement funds. However, generating enough income to enjoy a comfortable retirement requires managing that cash flow successfully, says CNBC.com in the article <strong><span style=\"color: #3ab3c7;\"><em><a style=\"color: #3ab3c7;\" href=\"https:\/\/www.cnbc.com\/2019\/02\/28\/here-are-8-costly-retirement-mistakes-to-avoid.html?__source=newsletter%7Cyourwealth\" target=\"_blank\" rel=\"noopener\">“Here are 8 costly retirement mistakes to avoid.”<\/a><\/em><\/span><\/strong><\/p>\n<p><strong>Big Eight: Retirement Mistakes to Avoid:<\/strong><\/p>\n<p><strong>Preparing for the risk of a bear market.<\/strong> If markets take a nosedive the year you retire and you stick with your plan to withdraw four percent from your portfolio, your plan is no longer sustainable. Better: have an emergency fund in place, so you don’t have to tap investment accounts until the market recovers.<\/p>\n<p><strong>Investing with inflation in mind.<\/strong> We have been in such a low inflation environment for so long, that many have forgotten how devastating this can be to retirement portfolios. You may want to have some of your money in the market, so you can continue to get rates above any inflation. If inflation runs about 3.5% annually, a moderate portfolio returning 6% or 7% keeps up with inflation, even after withdrawals.<\/p>\n<p><strong>What about interest rates and inadequate returns on safer investments?<\/strong> This is a tricky one, requiring a balance between each person’s comfort zone and the need to grow investments. Current fixed-income returns lag behind historical performance. Some experts recommend that their clients look into high-dividend stocks, as an alternative to bond yields.<\/p>\n<p><strong>Be ready for longevity. Worries about outliving retirement savings are due to a longer overall life expectancy. There’s a good chance that many people alive today, will make it to 95. One strong tactic is to delay taking Social Security benefits until age 70, to maximize the monthly benefit.<br \/>\n<\/strong><br \/>\n<strong>NOT to dump stocks in a temporary downturn.<\/strong> Without strong stomachs and wise counsel, individual investors have a long history of dumping stocks when markets turn down, amplifying losses. We are emotional about our money, which is the worst way to invest. Try working with a financial advisor to remove the emotion from your investments.<\/p>\n<p><strong>Don’t withdraw too much too soon.<\/strong> It looks like a lot of money, doesn’t it? However, even 4% may be too much to take out from your investments and retirement accounts. It all depends upon what other sources of income you have and how markets perform. Be careful, unless going back to work in your seventies is on your bucket list.<\/p>\n<p><strong>Prepare for cognitive decline.<\/strong> This is way harder to conceive of than inflationary risks, but it becomes a real risk as we age. Even a modest level of age-related cognitive impairment, can make managing investments a challenge. Have a discussion with family members, your estate planning attorney and a financial advisor about deciding who will manage your investments, when you are no longer able.<\/p>\n<p><strong>Are you ready for health care costs?<\/strong> If at all possible, wait until 65 to retire, so you will be eligible for Medicare. Even when you have this coverage in place, there may still be considerable expenses that are not covered by Medicare. If you don’t have long-term care insurance, get it as soon as possible. In the event you are not qualified plan to qualify for medicaid to assist with long term care costs.<\/p>\n<p>Please review the Big Eight: Retirement Mistakes to Avoid with your financial adviser and estate planning attorney.<\/p>\n<ul>\n<li>Reference:<\/li>\n<li><strong>CNBC.com (March 5, 2019)<\/strong> <strong><span style=\"color: #3ab3c7;\"><em><a style=\"color: #3ab3c7;\" href=\"https:\/\/www.cnbc.com\/2019\/02\/28\/here-are-8-costly-retirement-mistakes-to-avoid.html?__source=newsletter%7Cyourwealth\" target=\"_blank\" rel=\"noopener\">“Here are 8 costly retirement mistakes to avoid.”<\/a><\/em><\/span><\/strong><\/li>\n<\/ul>\n<p>Related Articles:<\/p>\n<ul>\n<li><strong><span style=\"color: #3ab3c7;\"><em><a style=\"color: #3ab3c7;\" href=\"https:\/\/www.cnbc.com\/2019\/02\/28\/here-are-8-costly-retirement-mistakes-to-avoid.html?__source=newsletter%7Cyourwealth\" target=\"_blank\" rel=\"noopener\">“Here are 8 costly retirement mistakes to avoid.”<\/a><\/em><\/span><\/strong><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>“You don’t stop laughing when you grow old, you grow old when you stop laughing.” George Bernard Shaw. “Living each day as if it were your last doesn’t mean your last day of retirement on a remote island. It means to live fully, authentically and spontaneously with nothing being held back.” Jack Canfield. During our<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[20],"tags":[],"class_list":["post-1673","post","type-post","status-publish","format-standard","hentry","category-blog"],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1673","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/comments?post=1673"}],"version-history":[{"count":0,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1673\/revisions"}],"wp:attachment":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media?parent=1673"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/categories?post=1673"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/tags?post=1673"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}