{"id":1677,"date":"2022-03-08T09:19:01","date_gmt":"2022-03-08T09:19:01","guid":{"rendered":"https:\/\/mudratcs.com\/frank\/?p=1677"},"modified":"2024-05-27T09:15:51","modified_gmt":"2024-05-27T09:15:51","slug":"a-love-letter-to-your-family","status":"publish","type":"post","link":"https:\/\/frankbrunolaw.com\/a-love-letter-to-your-family\/","title":{"rendered":"A Love Letter to Your Family"},"content":{"rendered":"<p>A Love Letter to Your Family.<\/p>\n<p>“A real love letter is made of insight, understanding, and compassion. Otherwise it’s not a love letter. A true love letter can produce a transformation in the other person, and therefore in the world. But before it produces a transformation in the other person, it has to produce a transformation within us. Some letters may take the whole of our lifetime to write.”<br \/>\n― Thich Nhat Hanh, Your True Home: The Everyday Wisdom of Thich Nhat Hanh: 365 days of practical, powerful teachings from the beloved Zen teacher<\/p>\n<p>“Wish not so much to live long as to live well.” <em>– Poor Richard’s Almanack, 1738<\/em><\/p>\n<p>Now, to the 70% of Americans who do not have an estate plan, the article <strong><span style=\"color: #3ab3c7;\"><em><a style=\"color: #3ab3c7;\" href=\"https:\/\/www.lockportjournal.com\/news\/lifestyles\/senior-spotlight-composing-the-family-love-letter\/article_257dad64-946a-53e9-b421-6dc3e9579bc7.html\" target=\"_blank\" rel=\"noreferrer noopener\">“Senior Spotlight: Composing the ‘family love letter’”<\/a><\/em><\/span><\/strong> from the <em>Lockport Journal <\/em>should help you understand why this is so important. One reason why people don’t take care of this simple task, is because they don’t fully understand why estate planning is needed. They think it’s only for the wealthy, or that it’s only for old people, or even that it’s only about death and taxes.<\/p>\n<p>Consider this idea: an estate plan is about protecting yourself while you are alive, protecting your family when you have passed and leaving a legacy for the living.<\/p>\n<p>Some of the main elements of an estate plan are to create and execute documents that provide for incapacity and death, as well as provide information about your assets, liabilities and wishes.<\/p>\n<p>You’ve spent a lifetime accumulating assets. It is now time to sit down with family members and have a heart-to-heart talk about the details of the estate and what your intentions are with respect to its distribution. The subject of death can be challenging for all. However, discussing your estate plan is vital, if you want to protect your family from what might come after you are gone. Each family has its own goals, so it’s a good idea to talk about it frankly, while you still can.<\/p>\n<p>Without discussions and an estate, the chances of a family split, assets not going where you had intended and unnecessarily higher costs in taxes and legal fees, are a very real possibility.<\/p>\n<p>If speaking about these topics is too hard, you may want to write your family a love letter. It would contain all the information that your family would need at the time of your death or if you become incapacitated because of illness or injury.<\/p>\n<p>Your estate plan should also include the documents needed, so your family can make decisions on your behalf, if you are incapacitated. That includes a power of attorney, a health care directive and may include others specific to your situation.<\/p>\n<p>Ideally, all this information will be located in one convenient place. Don’t put it on a computer where you use a password. If the family cannot access your computer, all your hard work will be useless to them. Put it in a folder or a notebook, that is clearly labeled and tell family members where it is.<\/p>\n<p>They’ll need this information:<\/p>\n<ul>\n<li>A list of your important contacts — your estate planning attorney, financial advisor, CPA, insurance broker and medical professionals.<\/li>\n<li>Credit card information, frequent flier miles.<\/li>\n<li>Insurance and benefits including all health, life, disability, long-term care, Medicare, property deeds, employment and any military benefits.<\/li>\n<li>Documents including your will, power of attorney, birth certificates, military papers, divorce decrees and citizenship papers.<\/li>\n<\/ul>\n<p>Think of these materials and discussions as your opportunity to <span style=\"color: #3ab3c7;\"><a style=\"color: #3ab3c7;\" href=\"https:\/\/frankbrunolaw.com\/a-love-letter-to-your-family\/\" target=\"_blank\" rel=\"noopener\"><strong>make a statement for the future generation<\/strong><\/a><\/span><a href=\"https:\/\/www.frankbrunolaw.com\/a-love-letter-to-your-family\/#\">.<\/a> If you don’t have an estate plan in place already or if you have not reviewed your estate plan in more than a few years, it’s time to make an appointment for a review. Your life may have not changed, but tax laws have, and you’ll want to be sure your estate is not entangled in old strategies that no longer benefit your family.<\/p>\n<p><em>Reference<\/em>: <strong>Lockport Journal<\/strong> (Feb. 16, 2019) <strong><span style=\"color: #3ab3c7;\"><em><a style=\"color: #3ab3c7;\" href=\"https:\/\/www.lockportjournal.com\/news\/lifestyles\/senior-spotlight-composing-the-family-love-letter\/article_257dad64-946a-53e9-b421-6dc3e9579bc7.html\" target=\"_blank\" rel=\"noreferrer noopener\">“Senior Spotlight: Composing the ‘family love letter’<\/a><\/em><\/span><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>A Love Letter to Your Family. “A real love letter is made of insight, understanding, and compassion. Otherwise it’s not a love letter. A true love letter can produce a transformation in the other person, and therefore in the world. But before it produces a transformation in the other person, it has to produce a<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[20],"tags":[],"class_list":["post-1677","post","type-post","status-publish","format-standard","hentry","category-blog"],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1677","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/comments?post=1677"}],"version-history":[{"count":0,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/posts\/1677\/revisions"}],"wp:attachment":[{"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/media?parent=1677"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/categories?post=1677"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/frankbrunolaw.com\/wp-json\/wp\/v2\/tags?post=1677"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}